other/emacs.org
#+TITLE: Emacs Configuration
#+AUTHOR: Romeu Vieira

#+OPTIONS: html-style:nil
#+OPTIONS: html-scripts:nil

#+OPTIONS: author:nil
#+OPTIONS: email:nil
#+OPTIONS: date:t
#+OPTIONS: toc:nil

#+PROPERTY: header-args :eval no

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/style.css"/>

#+EXPORT_FILE_NAME: emacs

#+INCLUDE: "~/.config/emacs/orgmacros.org"

#+BEGIN_EXPORT html
<p class="spacing-64" \>
#+END_EXPORT

#+TOC: headlines 3

#+BEGIN_EXPORT html
<p class="spacing-64" \>
#+END_EXPORT

* Garbage Collector

Set a ridiculously big number to the garbage collector threshold to speedup initialization.

#+BEGIN_SRC emacs-lisp
(setq gc-cons-threshold 60000000)
#+END_SRC

* Unknown Optimization

#+BEGIN_SRC emacs-lisp
;; file-name-handler-alist optimization
(defvar my--file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

(add-hook 'emacs-startup-hook
	  (lambda ()
	    (setq file-name-handler-alist my--file-name-handler-alist)))
#+END_SRC

* Window Settings

#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(toggle-scroll-bar -1)
(blink-cursor-mode 1)
#+END_SRC

* GNUTLS Changes

These changes were made because of the connection to MELPA and other package
archives. Still need to test the configuration without it.

#+BEGIN_SRC emacs-lisp
(setq gnutls-min-prime-bits 1024)
(setq gnutls-algorithm-priority "SECURE128:-VERS-SSL3.0:-VERS-TLS1.3")
#+END_SRC

* Package Services Initialization

Initialization of GNU Elpa, MELPA and Org package archives.

#+BEGIN_SRC emacs-lisp
(require 'package)

(add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)

;; Initialise the packages, avoiding a re-initialisation.
(unless (bound-and-true-p package--initialized)
  (setq package-enable-at-startup nil)
  (package-initialize))
#+END_SRC

* Use-package

Make sure it is installed first.

#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
#+END_SRC

Configure it and then load it.

#+BEGIN_SRC emacs-lisp
(eval-and-compile
  (setq use-package-always-ensure t)
  (setq use-package-always-defer t)
  (setq use-package-enable-imenu-support t)
  (setq use-package-hook-name-suffix nil))

(eval-when-compile
  (require 'use-package))
#+END_SRC

Then packages should be made available

#+BEGIN_SRC emacs-lisp
(setq package-enable-at-startup nil)
#+END_SRC

* Theme

Theme should be loaded early in the configuration because of scripts that use
org-mode and also need the colors from the specific theme in use.

#+BEGIN_SRC emacs-lisp
(load-theme 'gruvbox-dark-hard t)
(set-face-attribute 'mode-line nil :background "#1d2021" :foreground "#fbf1c7" :box "#fe8019")
#+END_SRC

