other/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emacs Configuration</h1>
<p class="spacing-64" \>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org451fc62">Garbage Collector</a></li>
<li><a href="#org23b66d1">Unknown Optimization</a></li>
<li><a href="#org926e5bb">Window Settings</a></li>
<li><a href="#orgeefc8ed">GNUTLS Changes</a></li>
<li><a href="#orgf178946">Package Services Initialization</a></li>
<li><a href="#orgcbc6082">Use-package</a></li>
<li><a href="#orgfc0c282">Theme</a></li>
<li><a href="#orgb5cf4a8">Functions</a></li>
<li><a href="#org3060d27">Configuration</a>
<ul>
<li><a href="#org5880f45">Early Loads</a></li>
<li><a href="#orga902cae">Early Modes</a></li>
<li><a href="#org71c09cf">Terminal Bindings</a></li>
<li><a href="#org21b2cf3">Better Defaults</a>
<ul>
<li><a href="#org128e0c7">Backups</a></li>
<li><a href="#org045977d">History</a></li>
<li><a href="#orga46d53e">Quiet Startup</a></li>
<li><a href="#orge2a1294">Visual Bells</a></li>
<li><a href="#org0fd92b9">Font</a></li>
<li><a href="#orgd7708bd">Disable Commands</a></li>
</ul>
</li>
<li><a href="#orga8ffac0">Better Keybinds</a>
<ul>
<li><a href="#org72135d8">Mouse</a></li>
</ul>
</li>
<li><a href="#org59d6426">Hooks</a></li>
</ul>
</li>
<li><a href="#org6e35881">Package Configuration</a>
<ul>
<li><a href="#org4e48c28">All The Icons</a></li>
<li><a href="#orgea712ef">Ansi Color</a></li>
<li><a href="#orgd3ed1ee">Async</a></li>
<li><a href="#org07b98b2">Auctex</a>
<ul>
<li><a href="#org9aeba34">Latexmk</a></li>
</ul>
</li>
<li><a href="#orgca17538">Auto Revert</a></li>
<li><a href="#org64bbe20">Avy</a></li>
<li><a href="#orga041fd9">Calendar</a></li>
<li><a href="#org1ce1ca3">CC-Mode</a></li>
<li><a href="#org925ee6f">Clean Aindent Mode</a></li>
<li><a href="#orgb2ebfea">Company</a></li>
<li><a href="#orge3b308a">Compile</a></li>
<li><a href="#org1c1d051">Counsel</a></li>
<li><a href="#org6683e64">Crux</a></li>
<li><a href="#orge3e7dfb">CSV Mode</a></li>
<li><a href="#org19bc414">Diary Lib</a></li>
<li><a href="#org0a0a483">Diff Hl</a></li>
<li><a href="#org727b4ef">Dired</a>
<ul>
<li><a href="#org77284d8">Dired Async</a></li>
<li><a href="#org268da9b">Dired Aux</a></li>
<li><a href="#org284b668">Dired Subtree</a></li>
<li><a href="#org4e75ac3">Find Dired</a></li>
</ul>
</li>
<li><a href="#org63a28ef">Eldoc</a></li>
<li><a href="#org35593c7">Electric</a></li>
<li><a href="#org28301df">Epa</a></li>
<li><a href="#orga56a2f9">Epg</a></li>
<li><a href="#org8383403">Exec Path from Shell</a></li>
<li><a href="#orgf5282b3">Git Time Machine</a></li>
<li><a href="#org3f47665">Gruvbox Theme</a></li>
<li><a href="#org450989f">Hungry Delete</a></li>
<li><a href="#org6a7a27d">Isearch</a></li>
<li><a href="#orgb9cf753">Ivy</a></li>
<li><a href="#org085339a">Magit</a>
<ul>
<li><a href="#org2dd3814">Git Commit</a></li>
<li><a href="#orgd94535a">Magit Repos</a></li>
</ul>
</li>
<li><a href="#org4b08f19">Markdown Mode</a></li>
<li><a href="#org63cf81b">Multiple Cursors</a></li>
<li><a href="#orgefc0466">Org Mode</a></li>
<li><a href="#org59625ec">Paren</a></li>
<li><a href="#org203fd51">Popwin</a></li>
<li><a href="#org717c8d5">Projectile</a></li>
<li><a href="#orgaf28118">Px</a></li>
<li><a href="#org48897cf">Rg</a></li>
<li><a href="#org08ff02f">Save Place</a></li>
<li><a href="#org2e4b9b3">Server</a></li>
<li><a href="#orgfe1fa26">So Long</a></li>
<li><a href="#org86a6305">Uniquify</a></li>
<li><a href="#orgcde331a">Window</a></li>
<li><a href="#orgd9bc76e">Which-Func</a></li>
</ul>
</li>
<li><a href="#orga129ddf">Last Steps</a></li>
<li><a href="#org674ee98">Rest of configuration</a></li>
</ul>
</div>
</div>

<p class="spacing-64" \>

<div id="outline-container-org451fc62" class="outline-2">
<h2 id="org451fc62">Garbage Collector</h2>
<div class="outline-text-2" id="text-org451fc62">
<p>
Set a ridiculously big number to the garbage collector threshold to speedup initialization.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq</span> gc-cons-threshold 60000000)
</pre>
</div>
</div>
</div>

<div id="outline-container-org23b66d1" class="outline-2">
<h2 id="org23b66d1">Unknown Optimization</h2>
<div class="outline-text-2" id="text-org23b66d1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">file-name-handler-alist optimization</span>
(<span style="color: #fb4933;">defvar</span> <span style="color: #83a598;">my--file-name-handler-alist</span> file-name-handler-alist)
(<span style="color: #fb4933;">setq</span> file-name-handler-alist nil)

(add-hook 'emacs-startup-hook
      (<span style="color: #fb4933;">lambda</span> ()
        (<span style="color: #fb4933;">setq</span> file-name-handler-alist my--file-name-handler-alist)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org926e5bb" class="outline-2">
<h2 id="org926e5bb">Window Settings</h2>
<div class="outline-text-2" id="text-org926e5bb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(toggle-scroll-bar -1)
(blink-cursor-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeefc8ed" class="outline-2">
<h2 id="orgeefc8ed">GNUTLS Changes</h2>
<div class="outline-text-2" id="text-orgeefc8ed">
<p>
These changes were made because of the connection to MELPA and other package
archives. Still need to test the configuration without it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq</span> gnutls-min-prime-bits 1024)
(<span style="color: #fb4933;">setq</span> gnutls-algorithm-priority <span style="color: #b8bb26;">"SECURE128:-VERS-SSL3.0:-VERS-TLS1.3"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf178946" class="outline-2">
<h2 id="orgf178946">Package Services Initialization</h2>
<div class="outline-text-2" id="text-orgf178946">
<p>
Initialization of GNU Elpa, MELPA and Org package archives.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">package</span>)

(add-to-list 'package-archives '(<span style="color: #b8bb26;">"gnu"</span> . <span style="color: #b8bb26;">"https://elpa.gnu.org/packages/"</span>) t)
(add-to-list 'package-archives '(<span style="color: #b8bb26;">"melpa"</span> . <span style="color: #b8bb26;">"https://melpa.org/packages/"</span>) t)
(add-to-list 'package-archives '(<span style="color: #b8bb26;">"org"</span> . <span style="color: #b8bb26;">"http://orgmode.org/elpa/"</span>) t)

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Initialise the packages, avoiding a re-initialisation.</span>
(<span style="color: #fb4933;">unless</span> (<span style="color: #fb4933;">bound-and-true-p</span> package--initialized)
  (<span style="color: #fb4933;">setq</span> package-enable-at-startup nil)
  (package-initialize))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcbc6082" class="outline-2">
<h2 id="orgcbc6082">Use-package</h2>
<div class="outline-text-2" id="text-orgcbc6082">
<p>
Make sure it is installed first.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
</pre>
</div>

<p>
Configure it and then load it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">eval-and-compile</span>
  (<span style="color: #fb4933;">setq</span> use-package-always-ensure t)
  (<span style="color: #fb4933;">setq</span> use-package-always-defer t)
  (<span style="color: #fb4933;">setq</span> use-package-enable-imenu-support t)
  (<span style="color: #fb4933;">setq</span> use-package-hook-name-suffix nil))

(<span style="color: #fb4933;">eval-when-compile</span>
  (<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">use-package</span>))
</pre>
</div>

<p>
Then packages should be made available
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq</span> package-enable-at-startup nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc0c282" class="outline-2">
<h2 id="orgfc0c282">Theme</h2>
<div class="outline-text-2" id="text-orgfc0c282">
<p>
Theme should be loaded early in the configuration because of scripts that use
org-mode and also need the colors from the specific theme in use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(load-theme 'gruvbox-dark-hard t)
(set-face-attribute 'mode-line nil <span style="color: #fe8019;">:background</span> <span style="color: #b8bb26;">"#1d2021"</span> <span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"#fbf1c7"</span> <span style="color: #fe8019;">:box</span> <span style="color: #b8bb26;">"#fe8019"</span>)
</pre>
</div>
</div>
</div>
