other/emacs.html

<div id="outline-container-orgb5cf4a8" class="outline-2">
<h2 id="orgb5cf4a8">Functions</h2>
<div class="outline-text-2" id="text-orgb5cf4a8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">kill-other-buffers</span> ()
  <span style="color: #b8bb26;">"Kill all other buffers except scratch."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (mapc 'kill-buffer (delq <span style="color: #b8bb26;">"*scratch*"</span> (buffer-list))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">prev-window</span> ()
  <span style="color: #b8bb26;">"CHANGE WINDOW."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (other-window -1))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-minibuffer-setup-hook</span> ()
  <span style="color: #b8bb26;">"GC BUFFER."</span>
  (<span style="color: #fb4933;">setq</span> gc-cons-threshold most-positive-fixnum))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-minibuffer-exit-hook</span> ()
  <span style="color: #b8bb26;">"GC BUFFER."</span>
  (run-at-time
   1 nil (<span style="color: #fb4933;">lambda</span> () (<span style="color: #fb4933;">setq</span> gc-cons-threshold 16777216))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">un-indent-by-removing-4-spaces</span> ()
  <span style="color: #b8bb26;">"remove 4 spaces from beginning of of line"</span>
  (<span style="color: #fb4933;">interactive</span>)
  (<span style="color: #fb4933;">save-excursion</span>
    (<span style="color: #fb4933;">save-match-data</span>
      (beginning-of-line)
      <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">get rid of tabs at beginning of line</span>
      (<span style="color: #fb4933;">when</span> (looking-at <span style="color: #b8bb26;">"^\\s-+"</span>)
    (untabify (match-beginning 0) (match-end 0)))
      (<span style="color: #fb4933;">when</span> (looking-at <span style="color: #b8bb26;">"^    "</span>)
    (replace-match <span style="color: #b8bb26;">""</span>)))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">duplicate-line</span> (arg)
  <span style="color: #b8bb26;">"Duplicate current line, leaving point in lower line."</span>
  (<span style="color: #fb4933;">interactive</span> <span style="color: #b8bb26;">"*p"</span>)
  (<span style="color: #fb4933;">setq</span> buffer-undo-list (cons (point) buffer-undo-list))
  (<span style="color: #fb4933;">let</span> ((bol (<span style="color: #fb4933;">save-excursion</span> (beginning-of-line) (point)))
    eol)
    (<span style="color: #fb4933;">save-excursion</span>
      (end-of-line)
      (<span style="color: #fb4933;">setq</span> eol (point))
      (<span style="color: #fb4933;">let</span> ((line (buffer-substring bol eol))
        (buffer-undo-list t)
        (count arg))
    (<span style="color: #fb4933;">while</span> (&gt; count 0)
      (newline)         <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">because there is no newline in 'line'</span>
      (insert line)
      (<span style="color: #fb4933;">setq</span> count (1- count)))
    )
      (<span style="color: #fb4933;">setq</span> buffer-undo-list (cons (cons eol (point)) buffer-undo-list)))
    )
  (next-line arg))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my/disable-scroll-bars</span> (frame)
  (modify-frame-parameters frame
               '((vertical-scroll-bars . nil)
                 (horizontal-scroll-bars . nil))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">endless/flycheck-dir</span> (dir)
  <span style="color: #b8bb26;">"Run flycheck for each file in current directory.</span>
<span style="color: #b8bb26;">Results are reported in a compilation buffer."</span>
  (<span style="color: #fb4933;">interactive</span> <span style="color: #b8bb26;">"DDirectory: "</span>)
  (<span style="color: #fb4933;">displaying-byte-compile-warnings</span>
   (<span style="color: #fb4933;">let</span> ((p nil))
     (<span style="color: #fb4933;">with-current-buffer</span> (get-buffer-create
               byte-compile-log-buffer)
       (<span style="color: #fb4933;">setq</span> default-directory dir)
       (<span style="color: #fb4933;">unless</span> (eq major-mode 'compilation-mode)
     (compilation-mode))
       (goto-char (point-max))
       (<span style="color: #fb4933;">let</span> ((inhibit-read-only t))
     (insert <span style="color: #b8bb26;">"\n\xc\n\n"</span>))
       (<span style="color: #fb4933;">setq</span> p (point)))
     (<span style="color: #fb4933;">dolist</span> (file (directory-files <span style="color: #b8bb26;">"./"</span> nil
                    <span style="color: #b8bb26;">"\\`[</span><span style="color: #b8bb26;">^</span><span style="color: #b8bb26;">\\.].*\\'"</span>))
       (endless/-flycheck-file file))
     (<span style="color: #fb4933;">with-selected-window</span> (display-buffer
                byte-compile-log-buffer)
       (goto-char p)
       (recenter 1)))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">endless/-report-error</span> (fmt <span style="color: #d3869b;">&amp;rest</span> args)
  <span style="color: #b8bb26;">"Print an error on `</span><span style="color: #d3869b;">byte-compile-log-buffer</span><span style="color: #b8bb26;">'."</span>
  (<span style="color: #fb4933;">let</span> ((inhibit-read-only t)
    (fill-prefix <span style="color: #b8bb26;">"    "</span>))
    (<span style="color: #fb4933;">with-current-buffer</span> byte-compile-log-buffer
      (<span style="color: #fb4933;">let</span> ((l (point)))
    (insert <span style="color: #b8bb26;">"\n"</span> (apply #'format fmt args))
    (fill-region (1+ l) (point))))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">endless/-flycheck-file</span> (file)
  <span style="color: #b8bb26;">"Check FILE and report to `</span><span style="color: #d3869b;">byte-compile-log-buffer</span><span style="color: #b8bb26;">'."</span>
  (<span style="color: #fb4933;">let</span> ((was-visited (find-buffer-visiting file)))
    (<span style="color: #fb4933;">with-current-buffer</span> (<span style="color: #fb4933;">or</span> was-visited
                 (<span style="color: #fb4933;">progn</span> (find-file file)
                    (current-buffer)))
      (<span style="color: #fb4933;">when</span> (<span style="color: #fb4933;">ignore-errors</span> (flycheck-buffer))
    (<span style="color: #fb4933;">while</span> (flycheck-running-p)
      (accept-process-output nil 0.1))
    (<span style="color: #fb4933;">pcase</span> flycheck-last-status-change
      ((<span style="color: #fb4933;">or</span> `errored `suspicious)
       (endless/-report-error
        <span style="color: #b8bb26;">"%s: Something wrong here!"</span>
        (file-name-nondirectory (buffer-file-name))))
      (`finished
       (<span style="color: #fb4933;">dolist</span> (e flycheck-current-errors)
         (endless/-report-error
          <span style="color: #b8bb26;">"%s:%s:%s:%s: %s"</span>
          (file-name-nondirectory (buffer-file-name))
          (flycheck-error-line e)
          (flycheck-error-column e)
          (flycheck-error-level e)
          (flycheck-error-message e))))))
      (<span style="color: #fb4933;">if</span> was-visited
      (bury-buffer was-visited)
    (kill-buffer (current-buffer))))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">insert-date</span> (prefix)
  <span style="color: #b8bb26;">"Insert the current date. With prefix-argument, use ISO format. With</span>
<span style="color: #b8bb26;">   two prefix arguments, write out the day and month name."</span>
  (<span style="color: #fb4933;">interactive</span> <span style="color: #b8bb26;">"P"</span>)
  (<span style="color: #fb4933;">let</span> ((format (<span style="color: #fb4933;">cond</span>
         ((not prefix) <span style="color: #b8bb26;">"%d.%m.%Y"</span>)
         ((equal prefix '(4)) <span style="color: #b8bb26;">"%Y-%m-%d"</span>)
         ((equal prefix '(16)) <span style="color: #b8bb26;">"%A, %d. %B %Y"</span>)))
    (system-time-locale <span style="color: #b8bb26;">"de_DE"</span>))
    (insert (format-time-string format))))

(<span style="color: #fb4933;">defadvice</span> <span style="color: #fabd2f;">move-beginning-of-line</span> (around smarter-bol activate)
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Move to requested line if needed.</span>
  (<span style="color: #fb4933;">let</span> ((arg (<span style="color: #fb4933;">or</span> (ad-get-arg 0) 1)))
    (<span style="color: #fb4933;">when</span> (/= arg 1)
      (forward-line (1- arg))))
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Move to indentation on first call, then to actual BOL on second.</span>
  (<span style="color: #fb4933;">let</span> ((pos (point)))
    (back-to-indentation)
    (<span style="color: #fb4933;">when</span> (= pos (point))
      ad-do-it)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">*-package-upgrade</span> ()
  <span style="color: #b8bb26;">"Upgrade all packages"</span>
  (<span style="color: #fb4933;">interactive</span>)
  (<span style="color: #fb4933;">save-window-excursion</span>
    (<span style="color: #fb4933;">with-temp-buffer</span>
      (package-list-packages)
      (package-menu-mark-upgrades)
      (package-menu-mark-obsolete-for-deletion)
      (package-menu-execute t))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">*-comment-or-uncomment-region-or-line</span> ()
  <span style="color: #b8bb26;">"Comments or uncomments the region or the current line if there's no active region."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (<span style="color: #fb4933;">let</span> (beg end)
    (<span style="color: #fb4933;">if</span> (region-active-p)
        (<span style="color: #fb4933;">setq</span> beg (region-beginning) end (region-end))
      (<span style="color: #fb4933;">setq</span> beg (line-beginning-position) end (line-end-position)))
    (comment-or-uncomment-region beg end)
    (forward-line)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">run-python3</span> ()
  (<span style="color: #fb4933;">interactive</span>)
  (run-python  <span style="color: #b8bb26;">"/usr/bin/python2"</span> nil t))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">run-python2</span> ()
  (<span style="color: #fb4933;">interactive</span>)
  (run-python  <span style="color: #b8bb26;">"/usr/bin/python"</span> nil t))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">run-ipython3</span> ()
  (<span style="color: #fb4933;">interactive</span>)
  (run-python  <span style="color: #b8bb26;">"/usr/bin/ipython"</span> nil t))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">python/pip-search</span> ()
  <span style="color: #b8bb26;">"Search for a pip package. at: https://pypi.python.org"</span>
  (<span style="color: #fb4933;">interactive</span>)
  (browse-url
   (format <span style="color: #b8bb26;">"https://pypi.python.org/pypi?%%3Aaction=search&amp;term=%s&amp;submit=search"</span>
           (read-string <span style="color: #b8bb26;">"Pip: "</span>)
           (message <span style="color: #b8bb26;">"Searching pip."</span>)
       )))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">python/doc-search</span> ()
  <span style="color: #b8bb26;">"Search Python3 official documentation. at: https://docs.python.org"</span>
  (<span style="color: #fb4933;">interactive</span>)
  (browse-url
   (format <span style="color: #b8bb26;">"https://docs.python.org/3/search.html?q=%s"</span>
           (read-string <span style="color: #b8bb26;">"Python3 doc: "</span>)
           )))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">untabify-buffer</span> ()
  (<span style="color: #fb4933;">interactive</span>)
  (untabify (point-min) (point-max)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">indent-buffer</span> ()
  (<span style="color: #fb4933;">interactive</span>)
  (indent-region (point-min) (point-max)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">cleanup-buffer</span> ()
  <span style="color: #b8bb26;">"Perform a bunch of operations on the whitespace content of a buffer."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (indent-buffer)
  (untabify-buffer)
  (delete-trailing-whitespace))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">lorem</span> ()
  <span style="color: #b8bb26;">"Insert a lorem ipsum."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (insert <span style="color: #b8bb26;">"Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do "</span>
          <span style="color: #b8bb26;">"eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim"</span>
          <span style="color: #b8bb26;">"ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut "</span>
          <span style="color: #b8bb26;">"aliquip ex ea commodo consequat. Duis aute irure dolor in "</span>
          <span style="color: #b8bb26;">"reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla "</span>
          <span style="color: #b8bb26;">"pariatur. Excepteur sint occaecat cupidatat non proident, sunt in "</span>
          <span style="color: #b8bb26;">"culpa qui officia deserunt mollit anim id est laborum."</span>))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">me/date-iso</span> ()
  <span style="color: #b8bb26;">"Insert the current date, ISO format, eg. 2016-12-09."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (insert (format-time-string <span style="color: #b8bb26;">"%F"</span>)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">me/date-iso-with-time</span> ()
  <span style="color: #b8bb26;">"Insert the current date, ISO format with time, eg. 2016-12-09T14:34:54+0100."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (insert (format-time-string <span style="color: #b8bb26;">"%FT%T%z"</span>)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">me/date-long</span> ()
  <span style="color: #b8bb26;">"Insert the current date, long format, eg. December 09, 2016."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (insert (format-time-string <span style="color: #b8bb26;">"%B %d, %Y"</span>)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">me/date-long-with-time</span> ()
  <span style="color: #b8bb26;">"Insert the current date, long format, eg. December 09, 2016 - 14:34."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (insert (capitalize (format-time-string <span style="color: #b8bb26;">"%B %d, %Y - %H:%M"</span>))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">me/date-short</span> ()
  <span style="color: #b8bb26;">"Insert the current date, short format, eg. 2016.12.09."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (insert (format-time-string <span style="color: #b8bb26;">"%Y.%m.%d"</span>)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">me/date-short-with-time</span> ()
  <span style="color: #b8bb26;">"Insert the current date, short format with time, eg. 2016.12.09 14:34"</span>
  (<span style="color: #fb4933;">interactive</span>)
  (insert (format-time-string <span style="color: #b8bb26;">"%Y.%m.%d %H:%M"</span>)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">me/delete-old-backup-files</span> ()
  <span style="color: #b8bb26;">"Delete old backup files."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (message <span style="color: #b8bb26;">"Deleting old backup files..."</span>)
  (<span style="color: #fb4933;">let</span> ((week (* 60 60 24 7))
    (current (float-time (current-time))))
    (<span style="color: #fb4933;">dolist</span> (file (directory-files temporary-file-directory t))
      (<span style="color: #fb4933;">when</span> (<span style="color: #fb4933;">and</span> (backup-file-name-p file)
         (&gt; (- current (float-time (fifth (file-attributes file))))
            week))
    (message <span style="color: #b8bb26;">"%s"</span> file)
    (delete-file file)))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-delete-word</span> (arg)
  <span style="color: #b8bb26;">"Delete characters forward until encountering the end of a word.</span>
<span style="color: #b8bb26;">With argument, do this that many times.</span>
<span style="color: #b8bb26;">This command does not push text to `</span><span style="color: #d3869b;">kill-ring</span><span style="color: #b8bb26;">'."</span>
  (<span style="color: #fb4933;">interactive</span> <span style="color: #b8bb26;">"p"</span>)
  (delete-region
   (point)
   (<span style="color: #fb4933;">progn</span>
     (forward-word arg)
     (point))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-backward-delete-word</span> (arg)
  <span style="color: #b8bb26;">"Delete characters backward until encountering the beginning of a word.</span>
<span style="color: #b8bb26;">With argument, do this that many times.</span>
<span style="color: #b8bb26;">This command does not push text to `</span><span style="color: #d3869b;">kill-ring</span><span style="color: #b8bb26;">'."</span>
  (<span style="color: #fb4933;">interactive</span> <span style="color: #b8bb26;">"p"</span>)
  (my-delete-word (- arg)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">edit-file-with-sudo</span> ()
  <span style="color: #b8bb26;">"Take the file currently being edited, and open it as root with `</span><span style="color: #d3869b;">sudo</span><span style="color: #b8bb26;">'."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (<span style="color: #fb4933;">let</span> ((file-name (buffer-file-name)))
    (<span style="color: #fb4933;">when</span> file-name
      (find-alternate-file (concat <span style="color: #b8bb26;">"/sudo::"</span> file-name)))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">prot/window-single-toggle</span> ()
  <span style="color: #b8bb26;">"Toggle between multiple windows and single window.</span>
<span style="color: #b8bb26;">This is the equivalent of maximising a window.  Tiling window</span>
<span style="color: #b8bb26;">managers such as DWM, BSPWM refer to this state as 'monocle'."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (<span style="color: #fb4933;">if</span> (one-window-p)
      (<span style="color: #fb4933;">when</span> prot/window-configuration
        (set-window-configuration prot/window-configuration))
    (<span style="color: #fb4933;">setq</span> prot/window-configuration (current-window-configuration))
    (delete-other-windows)))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">prot/window-dired-vc-root-left</span> ()
  (<span style="color: #fb4933;">interactive</span>)
  (<span style="color: #fb4933;">let</span> ((dir (<span style="color: #fb4933;">if</span> (eq (vc-root-dir) nil)
                 (dired-noselect default-directory)
               (dired-noselect (vc-root-dir)))))
    (display-buffer-in-side-window
     dir `((side . left)
           (slot . -1)
           (window-width . 0.16)
           (window-parameters
            . ((no-other-window . t)
               (no-delete-other-windows . t)
               (mode-line-format
                . (<span style="color: #b8bb26;">" "</span>
                   mode-line-buffer-identification))))))
    (<span style="color: #fb4933;">with-current-buffer</span> dir
      (rename-buffer <span style="color: #b8bb26;">"*Dired-Side*"</span>)
      (<span style="color: #fb4933;">setq-local</span> window-size-fixed 'width)))
  (<span style="color: #fb4933;">with-eval-after-load</span> 'ace-window
    (<span style="color: #fb4933;">when</span> (boundp 'aw-ignored-buffers)
      (add-to-list 'aw-ignored-buffers <span style="color: #b8bb26;">"*Dired-Side*"</span>))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">ap/garbage-collect</span> ()
  <span style="color: #b8bb26;">"Run `</span><span style="color: #d3869b;">garbage-collect</span><span style="color: #b8bb26;">' and print stats about memory usage."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (message (<span style="color: #fb4933;">cl-loop</span> for (type size used free) in (garbage-collect)
                    for used = (* used size)
                    for free = (* (<span style="color: #fb4933;">or</span> free 0) size)
                    for total = (file-size-human-readable (+ used free))
                    for used = (file-size-human-readable used)
                    for free = (file-size-human-readable free)
                    concat (format <span style="color: #b8bb26;">"%s: %s + %s = %s\n"</span> type used free total))))

(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">desperately-compile</span> ()
  <span style="color: #b8bb26;">"Traveling up the path, find a Makefile and `</span><span style="color: #d3869b;">compile</span><span style="color: #b8bb26;">'."</span>
  (<span style="color: #fb4933;">interactive</span>)
  (<span style="color: #fb4933;">when</span> (locate-dominating-file default-directory <span style="color: #b8bb26;">"Makefile"</span>)
    (<span style="color: #fb4933;">with-temp-buffer</span>
      (cd (locate-dominating-file default-directory <span style="color: #b8bb26;">"Makefile"</span>))
      (compile <span style="color: #b8bb26;">"make -k"</span>))))
</pre>
</div>
</div>
</div>
