other/emacs.org
* Configuration

** Early Loads

Load =tramp= and =bind-key= earlier.

#+BEGIN_SRC emacs-lisp
(require 'tramp)
(require 'bind-key)
#+END_SRC

** Early Modes

#+BEGIN_SRC emacs-lisp
(global-subword-mode 1)
(size-indication-mode t)
(xterm-mouse-mode t)
(delete-selection-mode t)
(transient-mark-mode t)
(column-number-mode 1)
(global-font-lock-mode t)
(savehist-mode 1)

(fringe-mode '(nil . 0))

                                        ; disable recentf mode
(recentf-mode -1)
(setq recentf-mode nil)

#+END_SRC

** Terminal Bindings
#+BEGIN_SRC emacs-lisp
(unless (display-graphic-p)
  (progn
    (define-key input-decode-map "\e[1;2A" [(shift up)])
    (define-key input-decode-map "\e[1;2B" [(shift down)])
    (define-key input-decode-map "\e[1;2C" [(shift right)])
    (define-key input-decode-map "\e[1;2D" [(shift left)])
    (define-key input-decode-map "\e[1;3A" [(alt up)])
    (define-key input-decode-map "\e[1;3B" [(alt down)])
    (define-key input-decode-map "\e[1;3C" [(alt right)])
    (define-key input-decode-map "\e[1;3D" [(alt left)])
    (define-key input-decode-map "\e[1;5A" [(control up)])
    (define-key input-decode-map "\e[1;5B" [(control down)])
    (define-key input-decode-map "\e[1;5C" [(control right)])
    (define-key input-decode-map "\e[1;5D" [(control left)])
    )
  )
#+END_SRC

** Better Defaults

#+BEGIN_SRC emacs-lisp
(setq-default
 ad-redefinition-action 'accept            ; silence ad-handle-definition about advised functions getting redefined
 auto-window-vscroll nil                   ; don’t automatically adjust window-vscroll to view tall lines
 bidi-paragraph-direction 'left-to-right   ; always left-to-right text
 confirm-kill-emacs 'yes-or-no-p           ; how exit confirmation is done
 cursor-type 'box                          ; cursor type
 cursor-in-non-selected-windows t          ; show cursor in non selected windows
 fast-but-imprecise-scrolling t            ; faster scrolling
 fill-column 80                            ; width for line breaks
 frame-title-format nil                    ; don’t display title
 help-window-select t                      ; always select help window
 indent-tabs-mode nil                      ; use spaces instead of tabs
 kill-whole-line t                         ; delete line including “\n”
 large-file-warning-threshold nil          ; no warning for large files
 line-move-visual nil                      ; required by track-eol
 load-prefer-newer t                       ; prefer newer version of files
 mouse-yank-at-point t                     ; paste with middle mouse button doesnt move cursor
 read-process-output-max (* 1024 1024)     ; maximum number of bytes to read from subprocess in a single chunk
 redisplay-dont-pause t                    ; don’t pause on redisplay
 require-final-newline t                   ; trailing newline in file
 select-enable-clipboard t                 ; cut/paste uses clipboard
 sentence-end-double-space nil             ; single space ends sentence
 set-mark-command-repeat-pop t             ; repeating set-mark after popping mark pops it again
 track-eol t                               ; keep cursor at end of lines
 underline-minimum-offset 1                ; minimum distance between baseline and underline
 use-file-dialog nil                       ; disable use of file dialog
 vc-follow-symlinks t                      ; no warning for symlinks
 x-select-enable-clipboard t               ; cut/paste uses clipboard
 x-stretch-cursor t                        ; draw cursor as wide as glyph underneath
 x-underline-at-descent-line t             ; draw the underline at the same place as the descent line
 )

;; Use 'fancy' ellipses for truncated strings
(setq truncate-string-ellipsis "…")

(setq-default adaptive-fill-regexp "[ t]+|[ t]*([0-9]+.|*+)[ t]*") ; regexp to match text at start of line that constitutes indentation
(setq-default adaptive-fill-first-line-regexp "^* *$")             ; regexp specifying whether to set fill prefix from a one-line paragraph

(setq-default sentence-end "\\([。、！？]\\|……\\|[,.?!][]\"')}]*\\($\\|[ \t]\\)\\)[ \t\n]*") ; regexp describing the end of a sentence
#+END_SRC

*** Backups

#+BEGIN_SRC emacs-lisp
(setq-default backup-directory-alist '(("." . "~/.config/emacs/backups")))
(setq-default backup-by-copying t)
(setq-default delete-old-versions t)
(setq-default kept-new-versions 6)
(setq-default kept-old-version 2)
(setq-default version-control t)
(setq-default vc-make-backup-files t)
(setq-default auto-save-file-name-transforms '((".*" "~/.config/emacs/auto-save-list/" t)))
#+END_SRC

