other/emacs.html

<div id="outline-container-org3060d27" class="outline-2">
<h2 id="org3060d27">Configuration</h2>
<div class="outline-text-2" id="text-org3060d27">
</div>
<div id="outline-container-org5880f45" class="outline-3">
<h3 id="org5880f45">Early Loads</h3>
<div class="outline-text-3" id="text-org5880f45">
<p>
Load <code>tramp</code> and <code>bind-key</code> earlier.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">tramp</span>)
(<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">bind-key</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga902cae" class="outline-3">
<h3 id="orga902cae">Early Modes</h3>
<div class="outline-text-3" id="text-orga902cae">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-subword-mode 1)
(size-indication-mode t)
(xterm-mouse-mode t)
(delete-selection-mode t)
(transient-mark-mode t)
(column-number-mode 1)
(global-font-lock-mode t)
(savehist-mode 1)

(fringe-mode '(nil . 0))

                                        <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">disable recentf mode</span>
(recentf-mode -1)
(<span style="color: #fb4933;">setq</span> recentf-mode nil)

</pre>
</div>
</div>
</div>

<div id="outline-container-org71c09cf" class="outline-3">
<h3 id="org71c09cf">Terminal Bindings</h3>
<div class="outline-text-3" id="text-org71c09cf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">unless</span> (display-graphic-p)
  (<span style="color: #fb4933;">progn</span>
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;2A"</span> [(shift up)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;2B"</span> [(shift down)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;2C"</span> [(shift right)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;2D"</span> [(shift left)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;3A"</span> [(alt up)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;3B"</span> [(alt down)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;3C"</span> [(alt right)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;3D"</span> [(alt left)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;5A"</span> [(control up)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;5B"</span> [(control down)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;5C"</span> [(control right)])
    (define-key input-decode-map <span style="color: #b8bb26;">"\e[1;5D"</span> [(control left)])
    )
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org21b2cf3" class="outline-3">
<h3 id="org21b2cf3">Better Defaults</h3>
<div class="outline-text-3" id="text-org21b2cf3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq-default</span>
 ad-redefinition-action 'accept            <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">silence ad-handle-definition about advised functions getting redefined</span>
 auto-window-vscroll nil                   <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">don&#8217;t automatically adjust window-vscroll to view tall lines</span>
 bidi-paragraph-direction 'left-to-right   <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">always left-to-right text</span>
 confirm-kill-emacs 'yes-or-no-p           <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">how exit confirmation is done</span>
 cursor-type 'box                          <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">cursor type</span>
 cursor-in-non-selected-windows t          <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">show cursor in non selected windows</span>
 fast-but-imprecise-scrolling t            <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">faster scrolling</span>
 fill-column 80                            <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">width for line breaks</span>
 frame-title-format nil                    <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">don&#8217;t display title</span>
 help-window-select t                      <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">always select help window</span>
 indent-tabs-mode nil                      <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">use spaces instead of tabs</span>
 kill-whole-line t                         <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">delete line including &#8220;\n&#8221;</span>
 large-file-warning-threshold nil          <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">no warning for large files</span>
 line-move-visual nil                      <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">required by track-eol</span>
 load-prefer-newer t                       <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">prefer newer version of files</span>
 mouse-yank-at-point t                     <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">paste with middle mouse button doesnt move cursor</span>
 read-process-output-max (* 1024 1024)     <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">maximum number of bytes to read from subprocess in a single chunk</span>
 redisplay-dont-pause t                    <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">don&#8217;t pause on redisplay</span>
 require-final-newline t                   <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">trailing newline in file</span>
 select-enable-clipboard t                 <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">cut/paste uses clipboard</span>
 sentence-end-double-space nil             <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">single space ends sentence</span>
 set-mark-command-repeat-pop t             <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">repeating set-mark after popping mark pops it again</span>
 track-eol t                               <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">keep cursor at end of lines</span>
 underline-minimum-offset 1                <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">minimum distance between baseline and underline</span>
 use-file-dialog nil                       <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">disable use of file dialog</span>
 vc-follow-symlinks t                      <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">no warning for symlinks</span>
 x-select-enable-clipboard t               <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">cut/paste uses clipboard</span>
 x-stretch-cursor t                        <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">draw cursor as wide as glyph underneath</span>
 x-underline-at-descent-line t             <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">draw the underline at the same place as the descent line</span>
 )

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Use 'fancy' ellipses for truncated strings</span>
(<span style="color: #fb4933;">setq</span> truncate-string-ellipsis <span style="color: #b8bb26;">"&#8230;"</span>)

(<span style="color: #fb4933;">setq-default</span> adaptive-fill-regexp <span style="color: #b8bb26;">"[ t]+|[ t]*([0-9]+.|*+)[ t]*"</span>) <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">regexp to match text at start of line that constitutes indentation</span>
(<span style="color: #fb4933;">setq-default</span> adaptive-fill-first-line-regexp <span style="color: #b8bb26;">"^* *$"</span>)             <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">regexp specifying whether to set fill prefix from a one-line paragraph</span>

(<span style="color: #fb4933;">setq-default</span> sentence-end <span style="color: #b8bb26;">"</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">(</span><span style="color: #b8bb26;">[&#12290;&#12289;&#65281;&#65311;]</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">|</span><span style="color: #b8bb26;">&#8230;&#8230;</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">|</span><span style="color: #b8bb26;">[,.?!][]\"')}]*</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">(</span><span style="color: #b8bb26;">$</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">|</span><span style="color: #b8bb26;">[ \t]</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">)</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">)</span><span style="color: #b8bb26;">[ \t\n]*"</span>) <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">regexp describing the end of a sentence</span>
</pre>
</div>
</div>

<div id="outline-container-org128e0c7" class="outline-4">
<h4 id="org128e0c7">Backups</h4>
<div class="outline-text-4" id="text-org128e0c7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq-default</span> backup-directory-alist '((<span style="color: #b8bb26;">"."</span> . <span style="color: #b8bb26;">"~/.config/emacs/backups"</span>)))
(<span style="color: #fb4933;">setq-default</span> backup-by-copying t)
(<span style="color: #fb4933;">setq-default</span> delete-old-versions t)
(<span style="color: #fb4933;">setq-default</span> kept-new-versions 6)
(<span style="color: #fb4933;">setq-default</span> kept-old-version 2)
(<span style="color: #fb4933;">setq-default</span> version-control t)
(<span style="color: #fb4933;">setq-default</span> vc-make-backup-files t)
(<span style="color: #fb4933;">setq-default</span> auto-save-file-name-transforms '((<span style="color: #b8bb26;">".*"</span> <span style="color: #b8bb26;">"~/.config/emacs/auto-save-list/"</span> t)))
</pre>
</div>
</div>
</div>
