other/emacs.org
*** History

#+BEGIN_SRC emacs-lisp
(setq-default savehist-file "~/.config/emacs/savehist")
(setq-default history-length t)
(setq-default history-delete-duplicates t)
(setq-default savehist-save-minibuffer-history 1)
(setq-default savehist-additional-variables '(kill-ring search-ring regexp-search-ring))
#+END_SRC

*** Quiet Startup

#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-screen t)
(setq inhibit-startup-message t)
(setq inhibit-startup-echo-area-message t)
(setq initial-scratch-message nil)
(defun display-startup-echo-area-message () (message ""))
#+END_SRC

*** Visual Bells

#+BEGIN_SRC emacs-lisp
(setq-default echo-keystrokes 0.1)
(setq-default use-dialog-box nil)
(setq-default visible-bell t)
(setq-default ring-bell-function 'ignore)
#+END_SRC

*** Font

#+BEGIN_SRC emacs-lisp
(setq-default use-default-font-for-symbols nil)
(setq-default inhibit-compacting-font-caches t)
(setq-default font-lock-maximum-decoration t)            ; use maximum decoration available
(setq-default jit-lock-defer-time 0.02)                  ; fontification is only deferred while there is input pending

(setq-default default-font-family "Sarasa Term K")
(set-frame-font "Sarasa Term K-12")
(setq-default default-frame-alist '((font . "Sarasa Term K-12") (height . 75)))

(set-fontset-font "fontset-default" nil (font-spec :size 11 :name "Symbola"))
(set-fontset-font "fontset-default" 'unicode "DejaVu Sans")

(set-locale-environment "en_US.UTF-8")
(set-default-coding-systems 'utf-8)
(prefer-coding-system 'utf-8)

;; highlight NOTE and TODO
(setq-default fixme-modes '(c++-mode c-mode emacs-lisp-mode))
(make-face 'font-lock-fixme-face)
(make-face 'font-lock-note-face)
(mapc (lambda (mode)
	(font-lock-add-keywords
	 mode
	 '(("\\<\\(TODO\\)" 1 'font-lock-fixme-face t)
	   ("\\<\\(NOTE\\)" 1 'font-lock-note-face t))))
      fixme-modes)
(modify-face 'font-lock-fixme-face "Red" nil nil t nil t nil nil)
(modify-face 'font-lock-note-face "Dark Green" nil nil t nil t nil nil)
#+END_SRC

*** Disable Commands

#+BEGIN_SRC emacs-lisp
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)
#+END_SRC
** Better Keybinds

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<home>") 'move-beginning-of-line)                  ; new home key action
(global-set-key (kbd "C-x C-;") #'*-comment-or-uncomment-region-or-line) ; comments
(global-set-key [C-backspace] 'my-backward-delete-word)                  ; C-Backspace deletes by word
(global-set-key (kbd "C-q") 'keyboard-quit)                              ; keyboard quit key
(global-set-key (kbd "C-g") 'goto-line)                                  ; go to line
(global-set-key [f5] 'desperately-compile)                               ; compile
(global-set-key (kbd "C-d") 'duplicate-line)                             ; duplicate current line

(global-set-key (kbd "<backtab>") 'un-indent-by-removing-4-spaces)       ; delete 4 spaces

(global-set-key (kbd "C-+") 'text-scale-increase)                        ; increase font size
(global-set-key (kbd "C--") 'text-scale-decrease)                        ; decrease font size

(global-set-key (kbd "C-.") 'other-window)                               ; move to other window
(global-set-key (kbd "C-,") 'prev-window)                                ; move to previous window

(global-unset-key (kbd "C-z"))                                           ; disable suspend frame
(global-unset-key (kbd "C-x C-z"))
(global-unset-key (kbd "C-h h"))
#+END_SRC

*** Mouse

Scroll up and down by 3 lines.

#+BEGIN_SRC emacs-lisp
(global-unset-key [mouse-2])
(global-set-key   [mouse-4] '(lambda () (interactive) (scroll-down 3)))
(global-set-key   [mouse-5] '(lambda () (interactive) (scroll-up   3)))
#+END_SRC

** Hooks

#+BEGIN_SRC emacs-lisp
                                        ; scroll bar new-frame
(add-hook 'after-make-frame-functions 'my/disable-scroll-bars)

                                        ; delete trailing whitespace on write
(add-hook 'write-file-hooks 'delete-trailing-whitespace)

(add-hook 'c-mode-hook (lambda () (local-unset-key (kbd "C-d"))))
(add-hook 'c++-mode-hook (lambda () (local-unset-key (kbd "C-d"))))
#+END_SRC


* Package Configuration

