other/emacs.html

<div id="outline-container-org045977d" class="outline-4">
<h4 id="org045977d">History</h4>
<div class="outline-text-4" id="text-org045977d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq-default</span> savehist-file <span style="color: #b8bb26;">"~/.config/emacs/savehist"</span>)
(<span style="color: #fb4933;">setq-default</span> history-length t)
(<span style="color: #fb4933;">setq-default</span> history-delete-duplicates t)
(<span style="color: #fb4933;">setq-default</span> savehist-save-minibuffer-history 1)
(<span style="color: #fb4933;">setq-default</span> savehist-additional-variables '(kill-ring search-ring regexp-search-ring))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga46d53e" class="outline-4">
<h4 id="orga46d53e">Quiet Startup</h4>
<div class="outline-text-4" id="text-orga46d53e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq</span> inhibit-startup-screen t)
(<span style="color: #fb4933;">setq</span> inhibit-startup-message t)
(<span style="color: #fb4933;">setq</span> inhibit-startup-echo-area-message t)
(<span style="color: #fb4933;">setq</span> initial-scratch-message nil)
(<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">display-startup-echo-area-message</span> () (message <span style="color: #b8bb26;">""</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2a1294" class="outline-4">
<h4 id="orge2a1294">Visual Bells</h4>
<div class="outline-text-4" id="text-orge2a1294">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq-default</span> echo-keystrokes 0.1)
(<span style="color: #fb4933;">setq-default</span> use-dialog-box nil)
(<span style="color: #fb4933;">setq-default</span> visible-bell t)
(<span style="color: #fb4933;">setq-default</span> ring-bell-function 'ignore)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0fd92b9" class="outline-4">
<h4 id="org0fd92b9">Font</h4>
<div class="outline-text-4" id="text-org0fd92b9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq-default</span> use-default-font-for-symbols nil)
(<span style="color: #fb4933;">setq-default</span> inhibit-compacting-font-caches t)
(<span style="color: #fb4933;">setq-default</span> font-lock-maximum-decoration t)            <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">use maximum decoration available</span>
(<span style="color: #fb4933;">setq-default</span> jit-lock-defer-time 0.02)                  <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">fontification is only deferred while there is input pending</span>

(<span style="color: #fb4933;">setq-default</span> default-font-family <span style="color: #b8bb26;">"Sarasa Term K"</span>)
(set-frame-font <span style="color: #b8bb26;">"Sarasa Term K-12"</span>)
(<span style="color: #fb4933;">setq-default</span> default-frame-alist '((font . <span style="color: #b8bb26;">"Sarasa Term K-12"</span>) (height . 75)))

(set-fontset-font <span style="color: #b8bb26;">"fontset-default"</span> nil (font-spec <span style="color: #fe8019;">:size</span> 11 <span style="color: #fe8019;">:name</span> <span style="color: #b8bb26;">"Symbola"</span>))
(set-fontset-font <span style="color: #b8bb26;">"fontset-default"</span> 'unicode <span style="color: #b8bb26;">"DejaVu Sans"</span>)

(set-locale-environment <span style="color: #b8bb26;">"en_US.UTF-8"</span>)
(set-default-coding-systems 'utf-8)
(prefer-coding-system 'utf-8)

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">highlight </span><span style="color: #006400; font-weight: bold; text-decoration: underline;">NOTE</span><span style="color: #7c6f64;"> and </span><span style="color: #ff0000; font-weight: bold; text-decoration: underline;">TODO</span>
(<span style="color: #fb4933;">setq-default</span> fixme-modes '(c++-mode c-mode emacs-lisp-mode))
(make-face 'font-lock-fixme-face)
(make-face 'font-lock-note-face)
(mapc (<span style="color: #fb4933;">lambda</span> (mode)
    (font-lock-add-keywords
     mode
     '((<span style="color: #b8bb26;">"\\&lt;</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">(</span><span style="color: #ff0000; font-weight: bold; text-decoration: underline;">TODO</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">)</span><span style="color: #b8bb26;">"</span> 1 'font-lock-fixme-face t)
       (<span style="color: #b8bb26;">"\\&lt;</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">(</span><span style="color: #006400; font-weight: bold; text-decoration: underline;">NOTE</span><span style="color: #b8bb26; font-weight: bold;">\\</span><span style="color: #b8bb26; font-weight: bold;">)</span><span style="color: #b8bb26;">"</span> 1 'font-lock-note-face t))))
      fixme-modes)
(modify-face 'font-lock-fixme-face <span style="color: #b8bb26;">"Red"</span> nil nil t nil t nil nil)
(modify-face 'font-lock-note-face <span style="color: #b8bb26;">"Dark Green"</span> nil nil t nil t nil nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7708bd" class="outline-4">
<h4 id="orgd7708bd">Disable Commands</h4>
<div class="outline-text-4" id="text-orgd7708bd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga8ffac0" class="outline-3">
<h3 id="orga8ffac0">Better Keybinds</h3>
<div class="outline-text-3" id="text-orga8ffac0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #b8bb26;">"&lt;home&gt;"</span>) 'move-beginning-of-line)                  <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">new home key action</span>
(global-set-key (kbd <span style="color: #b8bb26;">"C-x C-;"</span>) #'*-comment-or-uncomment-region-or-line) <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">comments</span>
(global-set-key [C-backspace] 'my-backward-delete-word)                  <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">C-Backspace deletes by word</span>
(global-set-key (kbd <span style="color: #b8bb26;">"C-q"</span>) 'keyboard-quit)                              <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">keyboard quit key</span>
(global-set-key (kbd <span style="color: #b8bb26;">"C-g"</span>) 'goto-line)                                  <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">go to line</span>
(global-set-key [f5] 'desperately-compile)                               <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">compile</span>
(global-set-key (kbd <span style="color: #b8bb26;">"C-d"</span>) 'duplicate-line)                             <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">duplicate current line</span>

(global-set-key (kbd <span style="color: #b8bb26;">"&lt;backtab&gt;"</span>) 'un-indent-by-removing-4-spaces)       <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">delete 4 spaces</span>

(global-set-key (kbd <span style="color: #b8bb26;">"C-+"</span>) 'text-scale-increase)                        <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">increase font size</span>
(global-set-key (kbd <span style="color: #b8bb26;">"C--"</span>) 'text-scale-decrease)                        <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">decrease font size</span>

(global-set-key (kbd <span style="color: #b8bb26;">"C-."</span>) 'other-window)                               <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">move to other window</span>
(global-set-key (kbd <span style="color: #b8bb26;">"C-,"</span>) 'prev-window)                                <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">move to previous window</span>

(global-unset-key (kbd <span style="color: #b8bb26;">"C-z"</span>))                                           <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">disable suspend frame</span>
(global-unset-key (kbd <span style="color: #b8bb26;">"C-x C-z"</span>))
(global-unset-key (kbd <span style="color: #b8bb26;">"C-h h"</span>))
</pre>
</div>
</div>

<div id="outline-container-org72135d8" class="outline-4">
<h4 id="org72135d8">Mouse</h4>
<div class="outline-text-4" id="text-org72135d8">
<p>
Scroll up and down by 3 lines.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-unset-key [mouse-2])
(global-set-key   [mouse-4] '(lambda () (<span style="color: #fb4933;">interactive</span>) (scroll-down 3)))
(global-set-key   [mouse-5] '(lambda () (<span style="color: #fb4933;">interactive</span>) (scroll-up   3)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org59d6426" class="outline-3">
<h3 id="org59d6426">Hooks</h3>
<div class="outline-text-3" id="text-org59d6426">
<div class="org-src-container">
<pre class="src src-emacs-lisp">                                        <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">scroll bar new-frame</span>
(add-hook 'after-make-frame-functions 'my/disable-scroll-bars)

                                        <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">delete trailing whitespace on write</span>
(add-hook 'write-file-hooks 'delete-trailing-whitespace)

(add-hook 'c-mode-hook (<span style="color: #fb4933;">lambda</span> () (local-unset-key (kbd <span style="color: #b8bb26;">"C-d"</span>))))
(add-hook 'c++-mode-hook (<span style="color: #fb4933;">lambda</span> () (local-unset-key (kbd <span style="color: #b8bb26;">"C-d"</span>))))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org6e35881" class="outline-2">
<h2 id="org6e35881">Package Configuration</h2>
<div class="outline-text-2" id="text-org6e35881">
</div>
