other/emacs.org
** All The Icons

#+BEGIN_SRC emacs-lisp
(use-package all-the-icons
  :config
  (set-fontset-font t 'unicode (font-spec :family "all-the-icons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "file-icons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "Material Icons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "github-octicons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "FontAwesome") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "Weather Icons") nil 'append)
  )
#+END_SRC
** Ansi Color

#+BEGIN_SRC emacs-lisp
(use-package ansi-color
  :commands ansi-color-display
  :hook (compilation-filter-hook . colorize-compilation-buffer)
  :config
  (defun ansi-color-display (start end)
    "Display ansi colors in region or whole buffer."
    (interactive (if (region-active-p)
                     (list (region-beginning) (region-end))
                   (list (point-min) (point-max))))
    (let ((inhibit-read-only t))
      (ansi-color-apply-on-region start end)))

  ;; Colorize output of Compilation Mode, see
  ;; http://stackoverflow.com/a/3072831/355252
  (defun colorize-compilation-buffer ()
    (let ((inhibit-read-only t))
      (ansi-color-apply-on-region (point-min) (point-max))))
  )
#+END_SRC

** Async

#+BEGIN_SRC emacs-lisp
(use-package async :ensure)
#+END_SRC

** Auctex

#+BEGIN_SRC emacs-lisp
(use-package auctex
  :mode (".tex" . latex-mode)
  :config
  (setq TeX-auto-save t)
  (setq TeX-engine 'xelatex)
  (setq TeX-PDF-mode t)

  (setq TeX-command-default "Latexmk")
  )
#+END_SRC

*** Latexmk

#+BEGIN_SRC emacs-lisp
(use-package auctex-latexmk
  :defer 0
  :init
  (auctex-latexmk-setup)
  :config
  (setq auctex-latexmk-inherit-TeX-PDF-mode t)
  (add-hook 'LaTeX-mode-hook
            (lambda ()
	      (push
	       '("LaTeXmk" "latexmk -pdf --synctex=1 -shell-escape -interaction=nonstopmode -file-line-error -synctex=1 %s" TeX-run-TeX nil t
		 :help "Run latexmk on file")
	       TeX-command-list)
              (push '("LuaLatex" "lualatex -pdf --synctex=1 -shell-escape -interaction=nonstopmode -file-line-error -synctex=1 %s" TeX-run-TeX nil t
		      :help "Run lualatex on file")
		    TeX-command-list)
              ))
  )
#+END_SRC

** Auto Revert

#+BEGIN_SRC emacs-lisp
(use-package autorevert
  :ensure nil
  :diminish
  :hook (after-init-hook . global-auto-revert-mode))
#+END_SRC

** Avy

#+BEGIN_SRC emacs-lisp
(use-package avy
  :bind
  ("M-s" . avy-goto-char)
  )
#+END_SRC
** Calendar

#+BEGIN_SRC emacs-lisp
(use-package calendar
  :ensure nil
  :defer
  :config
  (setq calendar-mark-diary-entries-flag t)
  (setq calendar-time-display-form
        '(24-hours ":" minutes
                   (when time-zone
                     (concat " (" time-zone ")"))))
  (setq calendar-week-start-day 1)      ; Monday
  (setq calendar-date-style 'iso)
  (setq calendar-christian-all-holidays-flag nil)
  (setq calendar-holiday-marker t)
  (setq calendar-holidays
        (append holiday-local-holidays  ; TODO set local holidays
                holiday-solar-holidays))

  (use-package solar
    :ensure nil
    :defer
    :config
    (setq calendar-latitude 40.641190
          calendar-longitude -8.653620))

  (use-package lunar
    :ensure nil
    :defer
    :config
    (setq lunar-phase-names
          '("New Moon"
            "First Quarter Moon"
            "Full Moon"
            "Last Quarter Moon")))

  :hook (calendar-today-visible-hook . calendar-mark-today))
#+END_SRC

** CC-Mode

#+BEGIN_SRC emacs-lisp
(use-package cc-mode
  :config
  (setq-default c-default-style "bsd")
  (setq-default c-basic-offset 4)

  ;; automatically indent when press RET
  (global-set-key (kbd "RET") 'newline-and-indent)

  (global-set-key (kbd "C-c w") 'whitespace-mode)
  (add-hook 'prog-mode-hook (lambda () (interactive) (setq show-trailing-whitespace 1)))

  (setq-default indent-tabs-mode t)
  (setq-default tab-width 4)

  (c-set-offset 'inlambda 0)
  (fset 'c-indent-region 'clang-format-region)

  (add-hook 'before-save-hook
	    (lambda ()
	      (when (member major-mode '(c-mode c++-mode))
		(progn
		  (if (string= (file-name-extension (buffer-name)) "h")
		      (message "Clang-format won’t work with this file format.")
		    (when (locate-dominating-file "." ".clang-format")
		      (clang-format-buffer))
		    )
		  ;; Return nil, to continue saving.
		  nil))))
  )
#+END_SRC

