other/emacs.html
<div id="outline-container-org4e48c28" class="outline-3">
<h3 id="org4e48c28">All The Icons</h3>
<div class="outline-text-3" id="text-org4e48c28">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">all-the-icons</span>
  <span style="color: #fe8019;">:config</span>
  (set-fontset-font t 'unicode (font-spec <span style="color: #fe8019;">:family</span> <span style="color: #b8bb26;">"all-the-icons"</span>) nil 'append)
  (set-fontset-font t 'unicode (font-spec <span style="color: #fe8019;">:family</span> <span style="color: #b8bb26;">"file-icons"</span>) nil 'append)
  (set-fontset-font t 'unicode (font-spec <span style="color: #fe8019;">:family</span> <span style="color: #b8bb26;">"Material Icons"</span>) nil 'append)
  (set-fontset-font t 'unicode (font-spec <span style="color: #fe8019;">:family</span> <span style="color: #b8bb26;">"github-octicons"</span>) nil 'append)
  (set-fontset-font t 'unicode (font-spec <span style="color: #fe8019;">:family</span> <span style="color: #b8bb26;">"FontAwesome"</span>) nil 'append)
  (set-fontset-font t 'unicode (font-spec <span style="color: #fe8019;">:family</span> <span style="color: #b8bb26;">"Weather Icons"</span>) nil 'append)
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-orgea712ef" class="outline-3">
<h3 id="orgea712ef">Ansi Color</h3>
<div class="outline-text-3" id="text-orgea712ef">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ansi-color</span>
  <span style="color: #fe8019;">:commands</span> ansi-color-display
  <span style="color: #fe8019;">:hook</span> (compilation-filter-hook . colorize-compilation-buffer)
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">ansi-color-display</span> (start end)
    <span style="color: #b8bb26;">"Display ansi colors in region or whole buffer."</span>
    (<span style="color: #fb4933;">interactive</span> (<span style="color: #fb4933;">if</span> (region-active-p)
                     (list (region-beginning) (region-end))
                   (list (point-min) (point-max))))
    (<span style="color: #fb4933;">let</span> ((inhibit-read-only t))
      (ansi-color-apply-on-region start end)))

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Colorize output of Compilation Mode, see</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">http://stackoverflow.com/a/3072831/355252</span>
  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">colorize-compilation-buffer</span> ()
    (<span style="color: #fb4933;">let</span> ((inhibit-read-only t))
      (ansi-color-apply-on-region (point-min) (point-max))))
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3ed1ee" class="outline-3">
<h3 id="orgd3ed1ee">Async</h3>
<div class="outline-text-3" id="text-orgd3ed1ee">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">async</span> <span style="color: #fe8019;">:ensure</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org07b98b2" class="outline-3">
<h3 id="org07b98b2">Auctex</h3>
<div class="outline-text-3" id="text-org07b98b2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">auctex</span>
  <span style="color: #fe8019;">:mode</span> (<span style="color: #b8bb26;">".tex"</span> . latex-mode)
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> TeX-auto-save t)
  (<span style="color: #fb4933;">setq</span> TeX-engine 'xelatex)
  (<span style="color: #fb4933;">setq</span> TeX-PDF-mode t)

  (<span style="color: #fb4933;">setq</span> TeX-command-default <span style="color: #b8bb26;">"Latexmk"</span>)
  )
</pre>
</div>
</div>

<div id="outline-container-org9aeba34" class="outline-4">
<h4 id="org9aeba34">Latexmk</h4>
<div class="outline-text-4" id="text-org9aeba34">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">auctex-latexmk</span>
  <span style="color: #fe8019;">:defer</span> 0
  <span style="color: #fe8019;">:init</span>
  (auctex-latexmk-setup)
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> auctex-latexmk-inherit-TeX-PDF-mode t)
  (add-hook 'LaTeX-mode-hook
            (<span style="color: #fb4933;">lambda</span> ()
          (<span style="color: #fb4933;">push</span>
           '(<span style="color: #b8bb26;">"LaTeXmk"</span> <span style="color: #b8bb26;">"latexmk -pdf --synctex=1 -shell-escape -interaction=nonstopmode -file-line-error -synctex=1 %s"</span> TeX-run-TeX nil t
         <span style="color: #fe8019;">:help</span> <span style="color: #b8bb26;">"Run latexmk on file"</span>)
           TeX-command-list)
              (<span style="color: #fb4933;">push</span> '(<span style="color: #b8bb26;">"LuaLatex"</span> <span style="color: #b8bb26;">"lualatex -pdf --synctex=1 -shell-escape -interaction=nonstopmode -file-line-error -synctex=1 %s"</span> TeX-run-TeX nil t
              <span style="color: #fe8019;">:help</span> <span style="color: #b8bb26;">"Run lualatex on file"</span>)
            TeX-command-list)
              ))
  )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgca17538" class="outline-3">
<h3 id="orgca17538">Auto Revert</h3>
<div class="outline-text-3" id="text-orgca17538">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">autorevert</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:diminish</span>
  <span style="color: #fe8019;">:hook</span> (after-init-hook . global-auto-revert-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org64bbe20" class="outline-3">
<h3 id="org64bbe20">Avy</h3>
<div class="outline-text-3" id="text-org64bbe20">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">avy</span>
  <span style="color: #fe8019;">:bind</span>
  (<span style="color: #b8bb26;">"M-s"</span> . avy-goto-char)
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-orga041fd9" class="outline-3">
<h3 id="orga041fd9">Calendar</h3>
<div class="outline-text-3" id="text-orga041fd9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">calendar</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> calendar-mark-diary-entries-flag t)
  (<span style="color: #fb4933;">setq</span> calendar-time-display-form
        '(24-hours <span style="color: #b8bb26;">":"</span> minutes
                   (<span style="color: #fb4933;">when</span> time-zone
                     (concat <span style="color: #b8bb26;">" ("</span> time-zone <span style="color: #b8bb26;">")"</span>))))
  (<span style="color: #fb4933;">setq</span> calendar-week-start-day 1)      <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">Monday</span>
  (<span style="color: #fb4933;">setq</span> calendar-date-style 'iso)
  (<span style="color: #fb4933;">setq</span> calendar-christian-all-holidays-flag nil)
  (<span style="color: #fb4933;">setq</span> calendar-holiday-marker t)
  (<span style="color: #fb4933;">setq</span> calendar-holidays
        (append holiday-local-holidays  <span style="color: #7c6f64;">; </span><span style="color: #ff0000; font-weight: bold; text-decoration: underline;">TODO</span><span style="color: #7c6f64;"> set local holidays</span>
                holiday-solar-holidays))

  (<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">solar</span>
    <span style="color: #fe8019;">:ensure</span> nil
    <span style="color: #fe8019;">:defer</span>
    <span style="color: #fe8019;">:config</span>
    (<span style="color: #fb4933;">setq</span> calendar-latitude 40.641190
          calendar-longitude -8.653620))

  (<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">lunar</span>
    <span style="color: #fe8019;">:ensure</span> nil
    <span style="color: #fe8019;">:defer</span>
    <span style="color: #fe8019;">:config</span>
    (<span style="color: #fb4933;">setq</span> lunar-phase-names
          '(<span style="color: #b8bb26;">"New Moon"</span>
            <span style="color: #b8bb26;">"First Quarter Moon"</span>
            <span style="color: #b8bb26;">"Full Moon"</span>
            <span style="color: #b8bb26;">"Last Quarter Moon"</span>)))

  <span style="color: #fe8019;">:hook</span> (calendar-today-visible-hook . calendar-mark-today))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ce1ca3" class="outline-3">
<h3 id="org1ce1ca3">CC-Mode</h3>
<div class="outline-text-3" id="text-org1ce1ca3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">cc-mode</span>
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq-default</span> c-default-style <span style="color: #b8bb26;">"bsd"</span>)
  (<span style="color: #fb4933;">setq-default</span> c-basic-offset 4)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">automatically indent when press RET</span>
  (global-set-key (kbd <span style="color: #b8bb26;">"RET"</span>) 'newline-and-indent)

  (global-set-key (kbd <span style="color: #b8bb26;">"C-c w"</span>) 'whitespace-mode)
  (add-hook 'prog-mode-hook (<span style="color: #fb4933;">lambda</span> () (<span style="color: #fb4933;">interactive</span>) (<span style="color: #fb4933;">setq</span> show-trailing-whitespace 1)))

  (<span style="color: #fb4933;">setq-default</span> indent-tabs-mode t)
  (<span style="color: #fb4933;">setq-default</span> tab-width 4)

  (c-set-offset 'inlambda 0)
  (fset 'c-indent-region 'clang-format-region)

  (add-hook 'before-save-hook
        (<span style="color: #fb4933;">lambda</span> ()
          (<span style="color: #fb4933;">when</span> (member major-mode '(c-mode c++-mode))
        (<span style="color: #fb4933;">progn</span>
          (<span style="color: #fb4933;">if</span> (string= (file-name-extension (buffer-name)) <span style="color: #b8bb26;">"h"</span>)
              (message <span style="color: #b8bb26;">"Clang-format won&#8217;t work with this file format."</span>)
            (<span style="color: #fb4933;">when</span> (locate-dominating-file <span style="color: #b8bb26;">"."</span> <span style="color: #b8bb26;">".clang-format"</span>)
              (clang-format-buffer))
            )
          <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Return nil, to continue saving.</span>
          nil))))
  )
</pre>
</div>
</div>
</div>
