other/emacs.org
** Clean Aindent Mode

#+BEGIN_SRC emacs-lisp
(use-package clean-aindent-mode
  :init
  (add-hook 'prog-mode-hook 'clean-aindent-mode))
#+END_SRC

** Company

#+BEGIN_SRC emacs-lisp
(use-package company
  :diminish company-mode
  :defines
  (company-dabbrev-ignore-case company-dabbrev-downcase)
  :init (global-company-mode)
  :custom
  (company-idle-delay 0)
  (company-echo-delay 0)
  (company-minimum-prefix-length 1)
  (company-tooltip-align-annotations t)
  :config
  (defun indent-or-complete ()
    (interactive)
    (if (looking-at "\\_>")
	(company-complete-common)
      (indent-according-to-mode)))

  (delete 'company-dabbrev company-backends)
  (delete 'company-oddmuse company-backends)
  (delete 'company-clang company-backends)
  (delete 'company-bbdb company-backends)
  (delete 'company-files company-backends)
  (delete '(company-dabbrev-code company-gtags company-etags company-keywords) company-backends)

  (setq company-require-match nil)
  (setq company-tooltip-idle-delay .25)

  (global-unset-key (kbd "C-SPC"))
  (global-set-key (kbd "C-SPC") 'company-complete)
  (global-set-key (kbd "<f9>") 'company-complete)

  ;; deactivate auto complete selection
  (define-key company-active-map (kbd "<return>") nil)
  (define-key company-active-map (kbd "RET") nil)
  )
#+END_SRC
** Compile

#+BEGIN_SRC emacs-lisp
(use-package compile
  :config
  (setq compile-command "make -C .. all")
  (setq compile-read-command nil)

  ;; Always save before compiling
  (setq compilation-ask-about-save nil)
  ;; Just kill old compile processes before starting the new one
  (setq compilation-always-kill t)
  ;; Scroll with the compilation output
  ;; Set to 'first-error to stop scrolling on first error
  (setq compilation-scroll-output t))
#+END_SRC
** Counsel

#+BEGIN_SRC emacs-lisp
(use-package counsel)
#+END_SRC
** Crux

#+BEGIN_SRC emacs-lisp
(use-package crux)
#+END_SRC
** CSV Mode

#+BEGIN_SRC emacs-lisp
(use-package csv-mode)
#+END_SRC
** Diary Lib

#+BEGIN_SRC emacs-lisp
(use-package diary-lib
  :ensure nil
  :defer
  :config
  (setq diary-file "~/.config/emacs/diary")
  (setq diary-entry-marker "diary")
  (setq diary-show-holidays-flag t)
  (setq diary-header-line-flag nil)
  (setq diary-mail-addr "romeu.bizz@gmail.com")
  (setq diary-mail-days 3)
  (setq diary-number-of-entries 3)
  (setq diary-comment-start ";")
  (setq diary-comment-end "")
  (setq diary-date-forms
        '((day "/" month "[^/0-9]")
          (day "/" month "/" year "[^0-9]")
          (day " *" monthname " *" year "[^0-9]")
          (monthname " *" day "[^,0-9]")
          (monthname " *" day ", *" year "[^0-9]")
          (year "[-/]" month "[-/]" day "[^0-9]")
          (dayname "\\W"))))
#+END_SRC
** Diff Hl

#+BEGIN_SRC emacs-lisp
(use-package diff-hl
  :init
  (custom-set-faces
   '(diff-hl-change ((t (:background "dark blue" :foreground "dark blue")))
		    '(diff-hl-insert ((t (:background "dark green" :foreground "dark green"))))
		    '(diff-hl-delete ((t (:background "dark red" :foreground "dark red"))))))
  (diff-hl-flydiff-mode)
  (diff-hl-margin-mode)
  (global-diff-hl-mode 1)

  (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
  )
#+END_SRC
** Dired

#+BEGIN_SRC emacs-lisp
(use-package dired
  :defer
  :ensure nil
  :config
  (setq dired-recursive-copies 'always)
  (setq dired-recursive-deletes 'always)
  (setq delete-by-moving-to-trash t)
  (setq dired-listing-switches
        "-AGFhlv --group-directories-first --time-style=long-iso")
  (setq dired-dwim-target t)
  :hook ((dired-mode-hook . dired-hide-details-mode)
         (dired-mode-hook . hl-line-mode)))
#+END_SRC

*** Dired Async

#+BEGIN_SRC emacs-lisp
(use-package dired-async
  :defer
  :ensure nil
  :after (dired async)
  :hook (dired-mode-hook . dired-async-mode))
#+END_SRC

*** Dired Aux

#+BEGIN_SRC emacs-lisp
(use-package dired-aux
  :defer
  :ensure nil
  :config
  (setq dired-isearch-filenames 'dwim)
  (setq dired-create-destination-dirs 'ask)
  (setq dired-vc-rename-file t)
  )
#+END_SRC

