other/emacs.html

<div id="outline-container-org925ee6f" class="outline-3">
<h3 id="org925ee6f">Clean Aindent Mode</h3>
<div class="outline-text-3" id="text-org925ee6f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">clean-aindent-mode</span>
  <span style="color: #fe8019;">:init</span>
  (add-hook 'prog-mode-hook 'clean-aindent-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2ebfea" class="outline-3">
<h3 id="orgb2ebfea">Company</h3>
<div class="outline-text-3" id="text-orgb2ebfea">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">company</span>
  <span style="color: #fe8019;">:diminish</span> company-mode
  <span style="color: #fe8019;">:defines</span>
  (company-dabbrev-ignore-case company-dabbrev-downcase)
  <span style="color: #fe8019;">:init</span> (global-company-mode)
  <span style="color: #fe8019;">:custom</span>
  (company-idle-delay 0)
  (company-echo-delay 0)
  (company-minimum-prefix-length 1)
  (company-tooltip-align-annotations t)
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">indent-or-complete</span> ()
    (<span style="color: #fb4933;">interactive</span>)
    (<span style="color: #fb4933;">if</span> (looking-at <span style="color: #b8bb26;">"\\_&gt;"</span>)
    (company-complete-common)
      (indent-according-to-mode)))

  (delete 'company-dabbrev company-backends)
  (delete 'company-oddmuse company-backends)
  (delete 'company-clang company-backends)
  (delete 'company-bbdb company-backends)
  (delete 'company-files company-backends)
  (delete '(company-dabbrev-code company-gtags company-etags company-keywords) company-backends)

  (<span style="color: #fb4933;">setq</span> company-require-match nil)
  (<span style="color: #fb4933;">setq</span> company-tooltip-idle-delay .25)

  (global-unset-key (kbd <span style="color: #b8bb26;">"C-SPC"</span>))
  (global-set-key (kbd <span style="color: #b8bb26;">"C-SPC"</span>) 'company-complete)
  (global-set-key (kbd <span style="color: #b8bb26;">"&lt;f9&gt;"</span>) 'company-complete)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">deactivate auto complete selection</span>
  (define-key company-active-map (kbd <span style="color: #b8bb26;">"&lt;return&gt;"</span>) nil)
  (define-key company-active-map (kbd <span style="color: #b8bb26;">"RET"</span>) nil)
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-orge3b308a" class="outline-3">
<h3 id="orge3b308a">Compile</h3>
<div class="outline-text-3" id="text-orge3b308a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">compile</span>
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> compile-command <span style="color: #b8bb26;">"make -C .. all"</span>)
  (<span style="color: #fb4933;">setq</span> compile-read-command nil)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Always save before compiling</span>
  (<span style="color: #fb4933;">setq</span> compilation-ask-about-save nil)
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Just kill old compile processes before starting the new one</span>
  (<span style="color: #fb4933;">setq</span> compilation-always-kill t)
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Scroll with the compilation output</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Set to 'first-error to stop scrolling on first error</span>
  (<span style="color: #fb4933;">setq</span> compilation-scroll-output t))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1c1d051" class="outline-3">
<h3 id="org1c1d051">Counsel</h3>
<div class="outline-text-3" id="text-org1c1d051">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">counsel</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6683e64" class="outline-3">
<h3 id="org6683e64">Crux</h3>
<div class="outline-text-3" id="text-org6683e64">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">crux</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge3e7dfb" class="outline-3">
<h3 id="orge3e7dfb">CSV Mode</h3>
<div class="outline-text-3" id="text-orge3e7dfb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">csv-mode</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org19bc414" class="outline-3">
<h3 id="org19bc414">Diary Lib</h3>
<div class="outline-text-3" id="text-org19bc414">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">diary-lib</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> diary-file <span style="color: #b8bb26;">"~/.config/emacs/diary"</span>)
  (<span style="color: #fb4933;">setq</span> diary-entry-marker <span style="color: #b8bb26;">"diary"</span>)
  (<span style="color: #fb4933;">setq</span> diary-show-holidays-flag t)
  (<span style="color: #fb4933;">setq</span> diary-header-line-flag nil)
  (<span style="color: #fb4933;">setq</span> diary-mail-addr <span style="color: #b8bb26;">"romeu.bizz@gmail.com"</span>)
  (<span style="color: #fb4933;">setq</span> diary-mail-days 3)
  (<span style="color: #fb4933;">setq</span> diary-number-of-entries 3)
  (<span style="color: #fb4933;">setq</span> diary-comment-start <span style="color: #b8bb26;">";"</span>)
  (<span style="color: #fb4933;">setq</span> diary-comment-end <span style="color: #b8bb26;">""</span>)
  (<span style="color: #fb4933;">setq</span> diary-date-forms
        '((day <span style="color: #b8bb26;">"/"</span> month <span style="color: #b8bb26;">"[</span><span style="color: #b8bb26;">^</span><span style="color: #b8bb26;">/0-9]"</span>)
          (day <span style="color: #b8bb26;">"/"</span> month <span style="color: #b8bb26;">"/"</span> year <span style="color: #b8bb26;">"[</span><span style="color: #b8bb26;">^</span><span style="color: #b8bb26;">0-9]"</span>)
          (day <span style="color: #b8bb26;">" *"</span> monthname <span style="color: #b8bb26;">" *"</span> year <span style="color: #b8bb26;">"[</span><span style="color: #b8bb26;">^</span><span style="color: #b8bb26;">0-9]"</span>)
          (monthname <span style="color: #b8bb26;">" *"</span> day <span style="color: #b8bb26;">"[</span><span style="color: #b8bb26;">^</span><span style="color: #b8bb26;">,0-9]"</span>)
          (monthname <span style="color: #b8bb26;">" *"</span> day <span style="color: #b8bb26;">", *"</span> year <span style="color: #b8bb26;">"[</span><span style="color: #b8bb26;">^</span><span style="color: #b8bb26;">0-9]"</span>)
          (year <span style="color: #b8bb26;">"[-/]"</span> month <span style="color: #b8bb26;">"[-/]"</span> day <span style="color: #b8bb26;">"[</span><span style="color: #b8bb26;">^</span><span style="color: #b8bb26;">0-9]"</span>)
          (dayname <span style="color: #b8bb26;">"\\W"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0a0a483" class="outline-3">
<h3 id="org0a0a483">Diff Hl</h3>
<div class="outline-text-3" id="text-org0a0a483">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">diff-hl</span>
  <span style="color: #fe8019;">:init</span>
  (custom-set-faces
   '(diff-hl-change ((t (<span style="color: #fe8019;">:background</span> <span style="color: #b8bb26;">"dark blue"</span> <span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"dark blue"</span>)))
            '(diff-hl-insert ((t (<span style="color: #fe8019;">:background</span> <span style="color: #b8bb26;">"dark green"</span> <span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"dark green"</span>))))
            '(diff-hl-delete ((t (<span style="color: #fe8019;">:background</span> <span style="color: #b8bb26;">"dark red"</span> <span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"dark red"</span>))))))
  (diff-hl-flydiff-mode)
  (diff-hl-margin-mode)
  (global-diff-hl-mode 1)

  (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-org727b4ef" class="outline-3">
<h3 id="org727b4ef">Dired</h3>
<div class="outline-text-3" id="text-org727b4ef">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">dired</span>
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> dired-recursive-copies 'always)
  (<span style="color: #fb4933;">setq</span> dired-recursive-deletes 'always)
  (<span style="color: #fb4933;">setq</span> delete-by-moving-to-trash t)
  (<span style="color: #fb4933;">setq</span> dired-listing-switches
        <span style="color: #b8bb26;">"-AGFhlv --group-directories-first --time-style=long-iso"</span>)
  (<span style="color: #fb4933;">setq</span> dired-dwim-target t)
  <span style="color: #fe8019;">:hook</span> ((dired-mode-hook . dired-hide-details-mode)
         (dired-mode-hook . hl-line-mode)))
</pre>
</div>
</div>

<div id="outline-container-org77284d8" class="outline-4">
<h4 id="org77284d8">Dired Async</h4>
<div class="outline-text-4" id="text-org77284d8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">dired-async</span>
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:after</span> (dired async)
  <span style="color: #fe8019;">:hook</span> (dired-mode-hook . dired-async-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org268da9b" class="outline-4">
<h4 id="org268da9b">Dired Aux</h4>
<div class="outline-text-4" id="text-org268da9b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">dired-aux</span>
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> dired-isearch-filenames 'dwim)
  (<span style="color: #fb4933;">setq</span> dired-create-destination-dirs 'ask)
  (<span style="color: #fb4933;">setq</span> dired-vc-rename-file t)
  )
</pre>
</div>
</div>
</div>
