other/emacs.org
*** Dired Subtree

#+BEGIN_SRC emacs-lisp
(use-package dired-subtree
  :defer
  :after dired
  :config
  (setq dired-subtree-use-backgrounds nil)
  :bind (:map dired-mode-map
              ("<tab>" . dired-subtree-toggle)
              ("<C-tab>" . dired-subtree-cycle)
              ("<S-iso-lefttab>" . dired-subtree-remove)))
#+END_SRC

*** Find Dired

#+BEGIN_SRC emacs-lisp
(use-package find-dired
  :defer
  :ensure nil
  :after dired
  :config
  (setq find-ls-option
        '("-ls" . "-AGFhlv --group-directories-first --time-style=long-iso"))
  (setq find-name-arg "-iname"))
#+END_SRC

** Eldoc

#+BEGIN_SRC emacs-lisp
(use-package eldoc
  :ensure nil
  :config (global-eldoc-mode -1))
#+END_SRC
** Electric

#+BEGIN_SRC emacs-lisp
(use-package electric
  :config
  (setq electric-pair-inhibit-predicate'electric-pair-conservative-inhibit)
  (setq electric-pair-preserve-balance t)
  (setq electric-pair-pairs
        '((8216 . 8217)
          (8220 . 8221)
          (171 . 187)))
  (setq electric-pair-skip-self 'electric-pair-default-skip-self)
  (setq electric-pair-skip-whitespace nil)
  (setq electric-pair-skip-whitespace-chars '(9 10 32))
  (setq electric-quote-context-sensitive t)
  (setq electric-quote-paragraph t)
  (setq electric-quote-string nil)
  (setq electric-quote-replace-double t)
  :hook (after-init-hook . (lambda ()
                             (electric-indent-mode 1)
                             (electric-pair-mode 1)
                             (electric-quote-mode 1)))
  )
#+END_SRC

** Epa

#+BEGIN_SRC emacs-lisp
(use-package epa
  :defer t
  :config
  ;; Always replace encrypted text with plain text version
  (setq epa-replace-original-text t)
  )
#+END_SRC

** Epg

#+BEGIN_SRC emacs-lisp
(use-package epg
  :defer t
  :config
  ;; Let Emacs query the passphrase through the minibuffer
  (setq epg-pinentry-mode 'loopback)
  )
#+END_SRC

** Exec Path from Shell

#+BEGIN_SRC emacs-lisp
(use-package exec-path-from-shell
  :ensure t
  :demand t
  :config (exec-path-from-shell-initialize))
#+END_SRC
** Git Time Machine

#+BEGIN_SRC emacs-lisp
(use-package git-timemachine
  :bind ("M-g t" . git-timemachine-toggle))
#+END_SRC

** Gruvbox Theme

#+BEGIN_SRC emacs-lisp
(use-package gruvbox-theme
  :defer 0
  :config
  (load-theme 'gruvbox-dark-hard)
  (set-face-attribute 'mode-line nil :background "#1d2021" :foreground "#fbf1c7" :box "#fe8019")
  )
#+END_SRC

** Hungry Delete

#+BEGIN_SRC emacs-lisp
(use-package hungry-delete
  :diminish
  :config
  (setq hungry-delete-chars-to-skip " \t\r\f\v")

  (defun rvg/hungry-delete-off ()
    (hungry-delete-mode -1))

  ;; hungry delete mode doesnt play well with multiple cursors...
  (add-hook 'multiple-cursors-mode-enabled-hook #'rvg/hungry-delete-off)
  (add-hook 'multiple-cursors-mode-disabled-hook #'rvg/hungry-delete-off)

  (global-hungry-delete-mode)
  )
#+END_SRC

** Isearch

#+BEGIN_SRC emacs-lisp
(use-package isearch
  :defer
  :ensure nil
  :diminish
  :config
  (setq search-highlight t)
  (setq search-whitespace-regexp ".*?")
  (setq isearch-lax-whitespace t)
  (setq isearch-regexp-lax-whitespace nil)
  (setq isearch-lazy-highlight t)

  (setq isearch-lazy-count t)
  (setq lazy-count-prefix-format nil)
  (setq lazy-count-suffix-format " (%s/%s)")
  (setq isearch-yank-on-move 'shift)
  (setq isearch-allow-scroll 'unlimited)

  (setq search-default-mode 'char-fold-to-regexp)
  )
#+END_SRC

