other/emacs.html

<div id="outline-container-org284b668" class="outline-4">
<h4 id="org284b668">Dired Subtree</h4>
<div class="outline-text-4" id="text-org284b668">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">dired-subtree</span>
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:after</span> dired
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> dired-subtree-use-backgrounds nil)
  <span style="color: #fe8019;">:bind</span> (<span style="color: #fe8019;">:map</span> dired-mode-map
              (<span style="color: #b8bb26;">"&lt;tab&gt;"</span> . dired-subtree-toggle)
              (<span style="color: #b8bb26;">"&lt;C-tab&gt;"</span> . dired-subtree-cycle)
              (<span style="color: #b8bb26;">"&lt;S-iso-lefttab&gt;"</span> . dired-subtree-remove)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e75ac3" class="outline-4">
<h4 id="org4e75ac3">Find Dired</h4>
<div class="outline-text-4" id="text-org4e75ac3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">find-dired</span>
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:after</span> dired
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> find-ls-option
        '(<span style="color: #b8bb26;">"-ls"</span> . <span style="color: #b8bb26;">"-AGFhlv --group-directories-first --time-style=long-iso"</span>))
  (<span style="color: #fb4933;">setq</span> find-name-arg <span style="color: #b8bb26;">"-iname"</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org63a28ef" class="outline-3">
<h3 id="org63a28ef">Eldoc</h3>
<div class="outline-text-3" id="text-org63a28ef">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">eldoc</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:config</span> (global-eldoc-mode -1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org35593c7" class="outline-3">
<h3 id="org35593c7">Electric</h3>
<div class="outline-text-3" id="text-org35593c7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">electric</span>
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> electric-pair-inhibit-predicate'electric-pair-conservative-inhibit)
  (<span style="color: #fb4933;">setq</span> electric-pair-preserve-balance t)
  (<span style="color: #fb4933;">setq</span> electric-pair-pairs
        '((8216 . 8217)
          (8220 . 8221)
          (171 . 187)))
  (<span style="color: #fb4933;">setq</span> electric-pair-skip-self 'electric-pair-default-skip-self)
  (<span style="color: #fb4933;">setq</span> electric-pair-skip-whitespace nil)
  (<span style="color: #fb4933;">setq</span> electric-pair-skip-whitespace-chars '(9 10 32))
  (<span style="color: #fb4933;">setq</span> electric-quote-context-sensitive t)
  (<span style="color: #fb4933;">setq</span> electric-quote-paragraph t)
  (<span style="color: #fb4933;">setq</span> electric-quote-string nil)
  (<span style="color: #fb4933;">setq</span> electric-quote-replace-double t)
  <span style="color: #fe8019;">:hook</span> (after-init-hook . (<span style="color: #fb4933;">lambda</span> ()
                             (electric-indent-mode 1)
                             (electric-pair-mode 1)
                             (electric-quote-mode 1)))
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org28301df" class="outline-3">
<h3 id="org28301df">Epa</h3>
<div class="outline-text-3" id="text-org28301df">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">epa</span>
  <span style="color: #fe8019;">:defer</span> t
  <span style="color: #fe8019;">:config</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Always replace encrypted text with plain text version</span>
  (<span style="color: #fb4933;">setq</span> epa-replace-original-text t)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orga56a2f9" class="outline-3">
<h3 id="orga56a2f9">Epg</h3>
<div class="outline-text-3" id="text-orga56a2f9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">epg</span>
  <span style="color: #fe8019;">:defer</span> t
  <span style="color: #fe8019;">:config</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Let Emacs query the passphrase through the minibuffer</span>
  (<span style="color: #fb4933;">setq</span> epg-pinentry-mode 'loopback)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org8383403" class="outline-3">
<h3 id="org8383403">Exec Path from Shell</h3>
<div class="outline-text-3" id="text-org8383403">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">exec-path-from-shell</span>
  <span style="color: #fe8019;">:ensure</span> t
  <span style="color: #fe8019;">:demand</span> t
  <span style="color: #fe8019;">:config</span> (exec-path-from-shell-initialize))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf5282b3" class="outline-3">
<h3 id="orgf5282b3">Git Time Machine</h3>
<div class="outline-text-3" id="text-orgf5282b3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">git-timemachine</span>
  <span style="color: #fe8019;">:bind</span> (<span style="color: #b8bb26;">"M-g t"</span> . git-timemachine-toggle))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f47665" class="outline-3">
<h3 id="org3f47665">Gruvbox Theme</h3>
<div class="outline-text-3" id="text-org3f47665">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">gruvbox-theme</span>
  <span style="color: #fe8019;">:defer</span> 0
  <span style="color: #fe8019;">:config</span>
  (load-theme 'gruvbox-dark-hard)
  (set-face-attribute 'mode-line nil <span style="color: #fe8019;">:background</span> <span style="color: #b8bb26;">"#1d2021"</span> <span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"#fbf1c7"</span> <span style="color: #fe8019;">:box</span> <span style="color: #b8bb26;">"#fe8019"</span>)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org450989f" class="outline-3">
<h3 id="org450989f">Hungry Delete</h3>
<div class="outline-text-3" id="text-org450989f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">hungry-delete</span>
  <span style="color: #fe8019;">:diminish</span>
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> hungry-delete-chars-to-skip <span style="color: #b8bb26;">" \t\r\f\v"</span>)

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">rvg/hungry-delete-off</span> ()
    (hungry-delete-mode -1))

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">hungry delete mode doesnt play well with multiple cursors...</span>
  (add-hook 'multiple-cursors-mode-enabled-hook #'rvg/hungry-delete-off)
  (add-hook 'multiple-cursors-mode-disabled-hook #'rvg/hungry-delete-off)

  (global-hungry-delete-mode)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a7a27d" class="outline-3">
<h3 id="org6a7a27d">Isearch</h3>
<div class="outline-text-3" id="text-org6a7a27d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">isearch</span>
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:diminish</span>
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> search-highlight t)
  (<span style="color: #fb4933;">setq</span> search-whitespace-regexp <span style="color: #b8bb26;">".*?"</span>)
  (<span style="color: #fb4933;">setq</span> isearch-lax-whitespace t)
  (<span style="color: #fb4933;">setq</span> isearch-regexp-lax-whitespace nil)
  (<span style="color: #fb4933;">setq</span> isearch-lazy-highlight t)

  (<span style="color: #fb4933;">setq</span> isearch-lazy-count t)
  (<span style="color: #fb4933;">setq</span> lazy-count-prefix-format nil)
  (<span style="color: #fb4933;">setq</span> lazy-count-suffix-format <span style="color: #b8bb26;">" (%s/%s)"</span>)
  (<span style="color: #fb4933;">setq</span> isearch-yank-on-move 'shift)
  (<span style="color: #fb4933;">setq</span> isearch-allow-scroll 'unlimited)

  (<span style="color: #fb4933;">setq</span> search-default-mode 'char-fold-to-regexp)
  )
</pre>
</div>
</div>
</div>
