other/emacs.org
** Ivy

#+BEGIN_SRC emacs-lisp
(use-package ivy
  :defer 0
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-wrap t)
  (setq enable-recursive-minibuffers t)
  (setq ivy-count-format "(%d/%d) ")

  (global-set-key "\C-s" 'swiper)
  (global-set-key (kbd "C-c C-r") 'ivy-resume)
  (global-set-key (kbd "<f6>") 'ivy-resume)

  (global-set-key (kbd "M-x") 'counsel-M-x)
  (global-set-key (kbd "C-x b") 'counsel-ibuffer)
  (global-set-key (kbd "C-x C-f") 'counsel-find-file)
  (global-set-key (kbd "C-M-l") 'counsel-imenu)

  (global-set-key (kbd "<f1> f") 'counsel-describe-function)
  (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
  (global-set-key (kbd "<f1> o") 'counsel-describe-symbol)
  (global-set-key (kbd "<f1> l") 'counsel-find-library)
  (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
  (global-set-key (kbd "<f2> u") 'counsel-unicode-char)

  (global-set-key (kbd "C-c F") 'counsel-org-file)
  (global-set-key (kbd "C-c k") 'counsel-rg)
  (global-set-key (kbd "C-x l") 'counsel-locate)
  (global-set-key (kbd "C-c L") 'counsel-git-log)
  (global-set-key (kbd "C-c g") 'counsel-git)
  (global-set-key (kbd "C-c m") 'counsel-linux-app)
  (global-set-key (kbd "C-c n") 'counsel-fzf)
  (global-set-key (kbd "C-c J") 'counsel-file-jump)
  (global-set-key (kbd "C-c t") 'counsel-load-theme)

  (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
  )
#+END_SRC
** Magit

#+BEGIN_SRC emacs-lisp
(use-package magit
  :diminish magit-auto-revert-mode
  :init
  (set-default 'magit-stage-all-confirm nil)
  (add-hook 'magit-mode-hook 'magit-load-config-extensions)
  :custom
  (magit-auto-revert-mode nil)
  :config
  (defun magit-quick-commit ()
    (interactive)
    (magit-stage-modified)
    (magit-commit))
  )
#+END_SRC

*** Git Commit

#+BEGIN_SRC emacs-lisp
(use-package git-commit
  :after magit
  :ensure nil
  :defer
  :config
  (setq git-commit-summary-max-length 100)
  (setq git-commit-known-pseudo-headers
        '("Signed-off-by"
          "Acked-by"
          "Modified-by"
          "Cc"
          "Suggested-by"
          "Reported-by"
          "Tested-by"
          "Reviewed-by"))
  (setq git-commit-style-convention-checks
        '(non-empty-second-line
          overlong-summary-line)))
#+END_SRC

*** Magit Repos

#+BEGIN_SRC emacs-lisp
(use-package magit-repos
  :after magit
  :ensure nil
  :defer
  :commands magit-list-repositories
  :config
  (setq magit-repository-directories
        '(("~/Documents/Projects/" . 1))))
#+END_SRC

** Markdown Mode

#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))
#+END_SRC

** Multiple Cursors

#+BEGIN_SRC emacs-lisp
(use-package multiple-cursors
  :bind (("C-c m"   . mc/edit-lines)
         ("C->"     . mc/mark-next-like-this)
         ("C-<"     . mc/mark-previous-like-this)
         ("C-c C-<" . mc/mark-all-like-this)))
#+END_SRC

