other/emacs.html

<div id="outline-container-orgb9cf753" class="outline-3">
<h3 id="orgb9cf753">Ivy</h3>
<div class="outline-text-3" id="text-orgb9cf753">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ivy</span>
  <span style="color: #fe8019;">:defer</span> 0
  <span style="color: #fe8019;">:config</span>
  (ivy-mode 1)
  (<span style="color: #fb4933;">setq</span> ivy-use-virtual-buffers t)
  (<span style="color: #fb4933;">setq</span> ivy-wrap t)
  (<span style="color: #fb4933;">setq</span> enable-recursive-minibuffers t)
  (<span style="color: #fb4933;">setq</span> ivy-count-format <span style="color: #b8bb26;">"(%d/%d) "</span>)

  (global-set-key <span style="color: #b8bb26;">"\C-s"</span> 'swiper)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c C-r"</span>) 'ivy-resume)
  (global-set-key (kbd <span style="color: #b8bb26;">"&lt;f6&gt;"</span>) 'ivy-resume)

  (global-set-key (kbd <span style="color: #b8bb26;">"M-x"</span>) 'counsel-M-x)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-x b"</span>) 'counsel-ibuffer)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-x C-f"</span>) 'counsel-find-file)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-M-l"</span>) 'counsel-imenu)

  (global-set-key (kbd <span style="color: #b8bb26;">"&lt;f1&gt; f"</span>) 'counsel-describe-function)
  (global-set-key (kbd <span style="color: #b8bb26;">"&lt;f1&gt; v"</span>) 'counsel-describe-variable)
  (global-set-key (kbd <span style="color: #b8bb26;">"&lt;f1&gt; o"</span>) 'counsel-describe-symbol)
  (global-set-key (kbd <span style="color: #b8bb26;">"&lt;f1&gt; l"</span>) 'counsel-find-library)
  (global-set-key (kbd <span style="color: #b8bb26;">"&lt;f2&gt; i"</span>) 'counsel-info-lookup-symbol)
  (global-set-key (kbd <span style="color: #b8bb26;">"&lt;f2&gt; u"</span>) 'counsel-unicode-char)

  (global-set-key (kbd <span style="color: #b8bb26;">"C-c F"</span>) 'counsel-org-file)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c k"</span>) 'counsel-rg)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-x l"</span>) 'counsel-locate)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c L"</span>) 'counsel-git-log)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c g"</span>) 'counsel-git)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c m"</span>) 'counsel-linux-app)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c n"</span>) 'counsel-fzf)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c J"</span>) 'counsel-file-jump)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c t"</span>) 'counsel-load-theme)

  (define-key minibuffer-local-map (kbd <span style="color: #b8bb26;">"C-r"</span>) 'counsel-minibuffer-history)
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-org085339a" class="outline-3">
<h3 id="org085339a">Magit</h3>
<div class="outline-text-3" id="text-org085339a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">magit</span>
  <span style="color: #fe8019;">:diminish</span> magit-auto-revert-mode
  <span style="color: #fe8019;">:init</span>
  (set-default 'magit-stage-all-confirm nil)
  (add-hook 'magit-mode-hook 'magit-load-config-extensions)
  <span style="color: #fe8019;">:custom</span>
  (magit-auto-revert-mode nil)
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">magit-quick-commit</span> ()
    (<span style="color: #fb4933;">interactive</span>)
    (magit-stage-modified)
    (magit-commit))
  )
</pre>
</div>
</div>

<div id="outline-container-org2dd3814" class="outline-4">
<h4 id="org2dd3814">Git Commit</h4>
<div class="outline-text-4" id="text-org2dd3814">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">git-commit</span>
  <span style="color: #fe8019;">:after</span> magit
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> git-commit-summary-max-length 100)
  (<span style="color: #fb4933;">setq</span> git-commit-known-pseudo-headers
        '(<span style="color: #b8bb26;">"Signed-off-by"</span>
          <span style="color: #b8bb26;">"Acked-by"</span>
          <span style="color: #b8bb26;">"Modified-by"</span>
          <span style="color: #b8bb26;">"Cc"</span>
          <span style="color: #b8bb26;">"Suggested-by"</span>
          <span style="color: #b8bb26;">"Reported-by"</span>
          <span style="color: #b8bb26;">"Tested-by"</span>
          <span style="color: #b8bb26;">"Reviewed-by"</span>))
  (<span style="color: #fb4933;">setq</span> git-commit-style-convention-checks
        '(non-empty-second-line
          overlong-summary-line)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd94535a" class="outline-4">
<h4 id="orgd94535a">Magit Repos</h4>
<div class="outline-text-4" id="text-orgd94535a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">magit-repos</span>
  <span style="color: #fe8019;">:after</span> magit
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:commands</span> magit-list-repositories
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> magit-repository-directories
        '((<span style="color: #b8bb26;">"~/Documents/Projects/"</span> . 1))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4b08f19" class="outline-3">
<h3 id="org4b08f19">Markdown Mode</h3>
<div class="outline-text-3" id="text-org4b08f19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">markdown-mode</span>
  <span style="color: #fe8019;">:commands</span> (markdown-mode gfm-mode)
  <span style="color: #fe8019;">:mode</span> ((<span style="color: #b8bb26;">"README\\.md\\'"</span> . gfm-mode)
         (<span style="color: #b8bb26;">"\\.md\\'"</span> . markdown-mode)
         (<span style="color: #b8bb26;">"\\.markdown\\'"</span> . markdown-mode))
  <span style="color: #fe8019;">:init</span> (<span style="color: #fb4933;">setq</span> markdown-command <span style="color: #b8bb26;">"multimarkdown"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org63cf81b" class="outline-3">
<h3 id="org63cf81b">Multiple Cursors</h3>
<div class="outline-text-3" id="text-org63cf81b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">multiple-cursors</span>
  <span style="color: #fe8019;">:bind</span> ((<span style="color: #b8bb26;">"C-c m"</span>   . mc/edit-lines)
         (<span style="color: #b8bb26;">"C-&gt;"</span>     . mc/mark-next-like-this)
         (<span style="color: #b8bb26;">"C-&lt;"</span>     . mc/mark-previous-like-this)
         (<span style="color: #b8bb26;">"C-c C-&lt;"</span> . mc/mark-all-like-this)))
</pre>
</div>
</div>
</div>
