other/emacs.html

<div id="outline-container-orgefc0466" class="outline-3">
<h3 id="orgefc0466">Org Mode</h3>
<div class="outline-text-3" id="text-orgefc0466">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">org</span>
  <span style="color: #fe8019;">:commands</span> org-indent-mode
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-maybe-lob-ingest</span> ()
    (<span style="color: #fb4933;">if</span> (<span style="color: #fb4933;">and</span> buffer-file-name
             (string-match
              (format <span style="color: #b8bb26;">"%s/.*code\\.inc$"</span> my-org-dir)
              buffer-file-name))
        (org-babel-lob-ingest buffer-file-name)))

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-after-save-hook</span> ()
    (my-maybe-lob-ingest))

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-org-mode-hook</span> ()
    (my-maybe-lob-ingest)
    (turn-on-auto-fill)
    (org-indent-mode 1))

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-chromium</span> (ppl)
    (start-process <span style="color: #b8bb26;">"fox"</span> nil <span style="color: #b8bb26;">"open"</span> <span style="color: #b8bb26;">"-a"</span>
                   <span style="color: #b8bb26;">"chromium"</span> (format <span style="color: #b8bb26;">"file://%s"</span> my-org-publish-dir)))

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-git-publish</span> (ppl)
    (<span style="color: #fb4933;">let</span> ((publish-script (format <span style="color: #b8bb26;">"%s/publish.sh"</span> my-org-publish-dir)))
      (<span style="color: #fb4933;">when</span> (file-executable-p publish-script)
    (start-process-shell-command <span style="color: #b8bb26;">"pub"</span> nil publish-script))))

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-publish</span> (a b c)
    (<span style="color: #fb4933;">setq</span> org-export-with-toc t)
    (org-html-publish-to-html a b c)
    (<span style="color: #fb4933;">setq</span> org-export-with-toc nil)
    (org-ascii-publish-to-ascii a b c)
    (org-gfm-publish-to-gfm a b c))

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">rg/date-sha256</span> ()
    (secure-hash 'sha256 (format-time-string <span style="color: #b8bb26;">"%Y-%m-%d %a %H:%M"</span>))
    )

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">rg/get-journal-file-month</span> ()
    (<span style="color: #fb4933;">let</span> ((monthly-name (format-time-string <span style="color: #b8bb26;">"%Y%m"</span>)))
      (expand-file-name (concat my-org-journal-dir monthly-name <span style="color: #b8bb26;">".org"</span>)))
    )

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">rg/get-journal-file-year</span> ()
    (<span style="color: #fb4933;">let</span> ((yearly-name (format-time-string <span style="color: #b8bb26;">"%Y"</span>)))
      (expand-file-name (concat my-org-journal-dir yearly-name <span style="color: #b8bb26;">".org"</span>)))
    )

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-org-inline-css-hook</span> (exporter)
    <span style="color: #b8bb26;">"Insert custom inline css"</span>
    (<span style="color: #fb4933;">when</span> (eq exporter 'html)
      (<span style="color: #fb4933;">let*</span> ((dir (<span style="color: #fb4933;">ignore-errors</span> (file-name-directory (buffer-file-name))))
         (path (concat dir <span style="color: #b8bb26;">"style.css"</span>))
         (homestyle (<span style="color: #fb4933;">or</span> (null dir) (null (file-exists-p path))))
         (final (<span style="color: #fb4933;">if</span> homestyle <span style="color: #b8bb26;">"~/.config/emacs/org-style.css"</span> path)))
    (<span style="color: #fb4933;">setq</span> org-html-head-include-default-style nil)
    (<span style="color: #fb4933;">setq</span> org-html-head (concat
                 <span style="color: #b8bb26;">"&lt;style type=\"text/css\"&gt;\n"</span>
                 <span style="color: #b8bb26;">"&lt;!--/*--&gt;&lt;![CDATA[/*&gt;&lt;!--*/\n"</span>
                 (<span style="color: #fb4933;">with-temp-buffer</span>
                               (insert-file-contents final)
                               (buffer-string))
                 <span style="color: #b8bb26;">"/*]]&gt;*/--&gt;\n"</span>
                 <span style="color: #b8bb26;">"&lt;/style&gt;\n"</span>)))))

  (add-hook 'org-export-before-processing-hook 'my-org-inline-css-hook)

  (<span style="color: #fb4933;">defvar</span> <span style="color: #83a598;">root-dir</span> <span style="color: #b8bb26;">"/home/romeu/Documents/Org/"</span>)
  (<span style="color: #fb4933;">defvar</span> <span style="color: #83a598;">my-org-dir</span> root-dir)
  (<span style="color: #fb4933;">defvar</span> <span style="color: #83a598;">my-org-publish-dir</span> (concat root-dir <span style="color: #b8bb26;">"Publish/"</span>))
  (<span style="color: #fb4933;">defvar</span> <span style="color: #83a598;">my-org-meta-dir</span> (concat root-dir <span style="color: #b8bb26;">"Meta/"</span>))
  (<span style="color: #fb4933;">defvar</span> <span style="color: #83a598;">my-org-archive-dir</span> (concat my-org-meta-dir <span style="color: #b8bb26;">"Archive/"</span>))
  (<span style="color: #fb4933;">defvar</span> <span style="color: #83a598;">my-org-journal-dir</span> (concat root-dir <span style="color: #b8bb26;">"Journal/"</span>))
  (<span style="color: #fb4933;">defvar</span> <span style="color: #83a598;">my-org-diary-file</span> (concat root-dir <span style="color: #b8bb26;">"Diary/Diary.org"</span>))

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">directories</span>
  (<span style="color: #fb4933;">setq</span> org-directory my-org-dir)
  (<span style="color: #fb4933;">setq</span> org-metadir my-org-meta-dir)
  (<span style="color: #fb4933;">setq</span> org-archive-location my-org-archive-dir)
  (<span style="color: #fb4933;">setq</span> org-agenda-files (list
              <span style="color: #b8bb26;">"/home/romeu/Documents/Org/Agenda/todo.org"</span>
              <span style="color: #b8bb26;">"/home/romeu/Documents/Org/Agenda/work.org"</span>
              <span style="color: #b8bb26;">"/home/romeu/Documents/Org/Agenda/birthdays.org"</span>
                          ))
  (<span style="color: #fb4933;">setq</span> diary-file my-org-diary-file)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">general configs</span>
  (<span style="color: #fb4933;">setq</span> org-image-actual-width nil)
  (<span style="color: #fb4933;">setq</span> org-startup-indented t)
  (<span style="color: #fb4933;">setq</span> org-babel-min-lines-for-block-output 1)
  (<span style="color: #fb4933;">setq</span> org-startup-folded <span style="color: #b8bb26;">"showeverything"</span>)
  (<span style="color: #fb4933;">setq</span> org-startup-with-inline-images t)
  (<span style="color: #fb4933;">setq</span> org-use-speed-commands t)
  (<span style="color: #fb4933;">setq</span> org-confirm-babel-evaluate nil)
  (<span style="color: #fb4933;">setq</span> org-reverse-note-order nil)
  (<span style="color: #fb4933;">setq</span> org-special-ctrl-a/e nil)
  (<span style="color: #fb4933;">setq</span> org-special-ctrl-k nil)
  (<span style="color: #fb4933;">setq</span> org-hide-emphasis-markers t)
  (<span style="color: #fb4933;">setq</span> org-catch-invisible-edits 'show)
  (<span style="color: #fb4933;">setq</span> org-return-follows-link nil)
  (<span style="color: #fb4933;">setq</span> org-loop-over-headlines-in-active-region 'start-level)
  (<span style="color: #fb4933;">setq</span> org-imenu-depth 7)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">selection</span>
  (<span style="color: #fb4933;">setq</span> org-fast-tag-selection-single-key t)
  (<span style="color: #fb4933;">setq</span> org-use-fast-todo-selection t)
  (<span style="color: #fb4933;">setq</span> org-support-shift-select 'always)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">refile</span>
  (<span style="color: #fb4933;">setq</span> org-refile-targets
        '((org-agenda-files . (<span style="color: #fe8019;">:maxlevel</span> . 2))
          (nil . (<span style="color: #fe8019;">:maxlevel</span> . 2))))
  (<span style="color: #fb4933;">setq</span> org-refile-use-outline-path t)
  (<span style="color: #fb4933;">setq</span> org-refile-allow-creating-parent-nodes 'confirm)
  (<span style="color: #fb4933;">setq</span> org-refile-use-cache t)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">todo</span>
  (<span style="color: #fb4933;">setq</span> org-enforce-todo-dependencies t)
  (<span style="color: #fb4933;">setq</span> org-enforce-todo-checkbox-dependencies t)

  (<span style="color: #fb4933;">setq</span> org-todo-keywords
        '((sequence <span style="color: #b8bb26;">"</span><span style="color: #ff0000; font-weight: bold; text-decoration: underline;">TODO</span><span style="color: #b8bb26;">(t)"</span> <span style="color: #b8bb26;">"NEXT(n!)"</span> <span style="color: #b8bb26;">"INPROGRESS(p!)"</span> <span style="color: #b8bb26;">"WAITING(w!)"</span> <span style="color: #b8bb26;">"|"</span> <span style="color: #b8bb26;">"DONE(D)"</span> <span style="color: #b8bb26;">"CANCELED(C)"</span>)
          (sequence <span style="color: #b8bb26;">"BACKLOG(b)"</span> <span style="color: #b8bb26;">"PLAN(p)"</span> <span style="color: #b8bb26;">"READY(r)"</span> <span style="color: #b8bb26;">"ACTIVE(a)"</span> <span style="color: #b8bb26;">"REVIEW(v)"</span> <span style="color: #b8bb26;">"WAIT(w@/!)"</span> <span style="color: #b8bb26;">"HOLD(h)"</span> <span style="color: #b8bb26;">"|"</span> <span style="color: #b8bb26;">"COMPLETED(c)"</span> <span style="color: #b8bb26;">"CANC(k@)"</span>)
          (sequence <span style="color: #b8bb26;">"MEET(m)"</span> <span style="color: #b8bb26;">"|"</span> <span style="color: #b8bb26;">"MET(M)"</span>)
          (sequence <span style="color: #b8bb26;">"STUDY(s)"</span> <span style="color: #b8bb26;">"|"</span> <span style="color: #b8bb26;">"STUDIED(S)"</span>)))

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Configure custom agenda views</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-custom-commands
        '((<span style="color: #b8bb26;">"d"</span> <span style="color: #b8bb26;">"Dashboard"</span>
           ((agenda <span style="color: #b8bb26;">""</span> ((org-deadline-warning-days 7)))
            (todo <span style="color: #b8bb26;">"PROC"</span> ((org-agenda-overriding-header <span style="color: #b8bb26;">"Process Tasks"</span>)))
            (todo <span style="color: #b8bb26;">"NEXT"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"Next Tasks"</span>)))
            (tags-todo <span style="color: #b8bb26;">"agenda/ACTIVE"</span> ((org-agenda-overriding-header <span style="color: #b8bb26;">"Active Projects"</span>)))))
          <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(todo "</span><span style="color: #ff0000; font-weight: bold; text-decoration: underline;">TODO</span><span style="color: #7c6f64;">"</span>
          <span style="color: #7c6f64;">;;   </span><span style="color: #7c6f64;">((org-agenda-overriding-header "Unprocessed Inbox Tasks")</span>
          <span style="color: #7c6f64;">;;    </span><span style="color: #7c6f64;">(org-agenda-files `(,dw/org-inbox-path))</span>
          <span style="color: #7c6f64;">;;    </span><span style="color: #7c6f64;">(org-agenda-text-search-extra-files nil)))))</span>

          (<span style="color: #b8bb26;">"n"</span> <span style="color: #b8bb26;">"Next Tasks"</span>
           ((todo <span style="color: #b8bb26;">"NEXT"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"Next Tasks"</span>)))))

          (<span style="color: #b8bb26;">"p"</span> <span style="color: #b8bb26;">"Active Projects"</span>
           ((agenda <span style="color: #b8bb26;">""</span>)
            (todo <span style="color: #b8bb26;">"ACTIVE"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"Active Projects"</span>)
                   (org-agenda-max-todos 5)
                   (org-agenda-files org-agenda-files)))))

          (<span style="color: #b8bb26;">"w"</span> <span style="color: #b8bb26;">"Workflow Status"</span>
           ((todo <span style="color: #b8bb26;">"WAIT"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"Waiting on External"</span>)
                   (org-agenda-files org-agenda-files)))
            (todo <span style="color: #b8bb26;">"REVIEW"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"In Review"</span>)
                   (org-agenda-files org-agenda-files)))
            (todo <span style="color: #b8bb26;">"PLAN"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"In Planning"</span>)
                   (org-agenda-todo-list-sublevels nil)
                   (org-agenda-files org-agenda-files)))
            (todo <span style="color: #b8bb26;">"BACKLOG"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"Project Backlog"</span>)
                   (org-agenda-todo-list-sublevels nil)
                   (org-agenda-files org-agenda-files)))
            (todo <span style="color: #b8bb26;">"READY"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"Ready for Work"</span>)
                   (org-agenda-files org-agenda-files)))
            (todo <span style="color: #b8bb26;">"ACTIVE"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"Active Projects"</span>)
                   (org-agenda-files org-agenda-files)))
            (todo <span style="color: #b8bb26;">"COMPLETED"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"Completed Projects"</span>)
                   (org-agenda-files org-agenda-files)))
            (todo <span style="color: #b8bb26;">"CANC"</span>
                  ((org-agenda-overriding-header <span style="color: #b8bb26;">"Cancelled Projects"</span>)
                   (org-agenda-files org-agenda-files)))))

          <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Projects on hold</span>
          (<span style="color: #b8bb26;">"h"</span> tags-todo <span style="color: #b8bb26;">"+LEVEL=2/+HOLD"</span>
           ((org-agenda-overriding-header <span style="color: #b8bb26;">"On-hold Projects"</span>)
            (org-agenda-files org-agenda-files)))

          <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Low-effort next actions</span>
          (<span style="color: #b8bb26;">"e"</span> tags-todo <span style="color: #b8bb26;">"+</span><span style="color: #ff0000; font-weight: bold; text-decoration: underline;">TODO</span><span style="color: #b8bb26;">=\"NEXT\"+Effort&lt;15&amp;+Effort&gt;0"</span>
           ((org-agenda-overriding-header <span style="color: #b8bb26;">"Low Effort Tasks"</span>)
            (org-agenda-max-todos 20)
            (org-agenda-files org-agenda-files)))))

  (<span style="color: #fb4933;">setq</span> org-todo-keyword-faces
        '(
          (<span style="color: #b8bb26;">"DONE"</span>      . (<span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"#afd8af"</span>     <span style="color: #fe8019;">:weight</span> bold))
          (<span style="color: #b8bb26;">"WAITING"</span>   . (<span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"dark salmon"</span> <span style="color: #fe8019;">:weight</span> bold))
          (<span style="color: #b8bb26;">"CANCELLED"</span> . (<span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"dim gray"</span>    <span style="color: #fe8019;">:weight</span> bold))
          (<span style="color: #b8bb26;">"BUY"</span>       . (<span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"goldenrod"</span>   <span style="color: #fe8019;">:weight</span> bold))
          (<span style="color: #b8bb26;">"HOWTO"</span>     . (<span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"SkyBlue3"</span>    <span style="color: #fe8019;">:weight</span> bold))
          (<span style="color: #b8bb26;">"INFO"</span>      . (<span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"khaki1"</span>      <span style="color: #fe8019;">:weight</span> bold))
          (<span style="color: #b8bb26;">"COLLECT"</span>   . (<span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"MediumSeaGreen"</span>   <span style="color: #fe8019;">:weight</span> bold))
          (<span style="color: #b8bb26;">"SOLVE"</span>     . (<span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"orange red"</span>    <span style="color: #fe8019;">:weight</span> bold))
          ))

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Configure common tags</span>
  (<span style="color: #fb4933;">setq</span> org-tag-alist
        '((<span style="color: #fe8019;">:startgroup</span>)
          <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Put mutually exclusive tags here</span>
          (<span style="color: #fe8019;">:endgroup</span>)
          (<span style="color: #b8bb26;">"@errand"</span> . ?E)
          (<span style="color: #b8bb26;">"@home"</span> . ?H)
          (<span style="color: #b8bb26;">"@work"</span> . ?W)
          (<span style="color: #b8bb26;">"agenda"</span> . ?a)
          (<span style="color: #b8bb26;">"planning"</span> . ?p)
          (<span style="color: #b8bb26;">"publish"</span> . ?P)
          (<span style="color: #b8bb26;">"batch"</span> . ?b)
          (<span style="color: #b8bb26;">"note"</span> . ?n)
          (<span style="color: #b8bb26;">"idea"</span> . ?i)
          (<span style="color: #b8bb26;">"thinking"</span> . ?t)
          (<span style="color: #b8bb26;">"recurring"</span> . ?r)))

  (<span style="color: #fb4933;">setq</span> org-ellipsis <span style="color: #b8bb26;">" &#9660; "</span>)
  (<span style="color: #fb4933;">setq</span> org-hide-leading-stars t)

  (<span style="color: #fb4933;">setq</span> org-pretty-entities t)
  (<span style="color: #fb4933;">setq</span> org-pretty-entities-include-sub-superscripts nil)

  (<span style="color: #fb4933;">setq</span> org-descriptive-links nil)

  (<span style="color: #fb4933;">setq</span> org-fontify-done-headline t)
  (<span style="color: #fb4933;">setq</span> org-fontify-quote-and-verse-blocks t)
  (<span style="color: #fb4933;">setq</span> org-fontify-whole-heading-line t)
  (<span style="color: #fb4933;">setq</span> org-fontify-whole-block-delimiter-line t)

  (<span style="color: #fb4933;">setq</span> org-track-ordered-property-with-tag t)
  (<span style="color: #fb4933;">setq</span> org-highest-priority ?A)
  (<span style="color: #fb4933;">setq</span> org-lowest-priority ?C)
  (<span style="color: #fb4933;">setq</span> org-default-priority ?A)

  (<span style="color: #fb4933;">setq</span> org-tags-column -110)
  (<span style="color: #fb4933;">setq</span> org-habit-graph-column 100)

  (<span style="color: #fb4933;">setq</span> org-babel-default-header-args (cons '(<span style="color: #fe8019;">:noweb</span> . <span style="color: #b8bb26;">"yes"</span>) (assq-delete-all <span style="color: #fe8019;">:noweb</span> org-babel-default-header-args)))
  (<span style="color: #fb4933;">setq</span> org-babel-default-header-args (cons '(<span style="color: #fe8019;">:exports</span> . <span style="color: #b8bb26;">"both"</span>) (assq-delete-all <span style="color: #fe8019;">:exports</span> org-babel-default-header-args)))
  (<span style="color: #fb4933;">setq</span> org-babel-default-header-args (cons '(<span style="color: #fe8019;">:results</span> . <span style="color: #b8bb26;">"output verbatim replace"</span>) (assq-delete-all <span style="color: #fe8019;">:results</span> org-babel-default-header-args)))

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">log</span>
  (<span style="color: #fb4933;">setq</span> org-log-done 'time)
  (<span style="color: #fb4933;">setq</span> org-log-into-drawer t)
  (<span style="color: #fb4933;">setq</span> org-log-note-clock-out nil)
  (<span style="color: #fb4933;">setq</span> org-log-redeadline nil)
  (<span style="color: #fb4933;">setq</span> org-log-reschedule nil)
  (<span style="color: #fb4933;">setq</span> org-read-date-prefer-future 'time)

  (custom-set-faces '(org-ellipsis ((t (<span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"gray40"</span> <span style="color: #fe8019;">:underline</span> nil)))))
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c c"</span>) 'org-capture)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c l"</span>) 'org-store-link)
  (global-set-key (kbd <span style="color: #b8bb26;">"C-c a"</span>) 'org-agenda)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Org Capture</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #ff0000; font-weight: bold; text-decoration: underline;">TODO</span><span style="color: #7c6f64;">: improve and add more templates</span>
  (<span style="color: #fb4933;">setq</span> org-capture-templates
        '(
      (<span style="color: #b8bb26;">"c"</span> <span style="color: #b8bb26;">"Code"</span>)

      (<span style="color: #b8bb26;">"cc"</span> <span style="color: #b8bb26;">"Cpp"</span>)
      (<span style="color: #b8bb26;">"ccs"</span> <span style="color: #b8bb26;">"Cpp Snippets"</span> entry (file+olp <span style="color: #b8bb26;">"Code/Cpp.org"</span> <span style="color: #b8bb26;">"Cpp"</span> <span style="color: #b8bb26;">"Snippets"</span>)
       <span style="color: #b8bb26;">"* %? %t"</span> <span style="color: #fe8019;">:empty-lines</span> 1)

      (<span style="color: #b8bb26;">"ck"</span> <span style="color: #b8bb26;">"Kotlin"</span>)
      (<span style="color: #b8bb26;">"cks"</span> <span style="color: #b8bb26;">"Kotlin Snippets"</span> entry (file+olp <span style="color: #b8bb26;">"Code/Kotlin.org"</span> <span style="color: #b8bb26;">"Kotlin"</span> <span style="color: #b8bb26;">"Snippets"</span>)
       <span style="color: #b8bb26;">"* %? %t"</span> <span style="color: #fe8019;">:empty-lines</span> 1)
      (<span style="color: #b8bb26;">"ckl"</span> <span style="color: #b8bb26;">"Kotlin Libs"</span>)
      (<span style="color: #b8bb26;">"ckln"</span> <span style="color: #b8bb26;">"Kotlin Native"</span> entry (file+headline <span style="color: #b8bb26;">"Code/Kotlin.org"</span> <span style="color: #b8bb26;">"Kotlin Native"</span>)
           <span style="color: #b8bb26;">"* %? %t"</span> <span style="color: #fe8019;">:empty-lines</span> 1)

      (<span style="color: #b8bb26;">"cr"</span> <span style="color: #b8bb26;">"Rust"</span>)
      (<span style="color: #b8bb26;">"crs"</span> <span style="color: #b8bb26;">"Rust Snippets"</span> entry (file+olp <span style="color: #b8bb26;">"Code/Rust.org"</span> <span style="color: #b8bb26;">"Rust"</span> <span style="color: #b8bb26;">"Snippets"</span>)
       <span style="color: #b8bb26;">"* %? %t"</span> <span style="color: #fe8019;">:empty-lines</span> 1)

          (<span style="color: #b8bb26;">"j"</span> <span style="color: #b8bb26;">"Personal Journal"</span> entry (file+datetree rg/get-journal-file-year)
           <span style="color: #b8bb26;">"* Entry %(rg/date-sha256) %T %^G\n\n%?\n"</span> <span style="color: #fe8019;">:kill-buffer</span> t <span style="color: #fe8019;">:empty-lines</span> 1)

          (<span style="color: #b8bb26;">"t"</span> <span style="color: #b8bb26;">"Todo"</span> entry (file <span style="color: #b8bb26;">"</span><span style="color: #ff0000; font-weight: bold; text-decoration: underline;">TODO</span><span style="color: #b8bb26;">.org"</span>)
           <span style="color: #b8bb26;">"* </span><span style="color: #ff0000; font-weight: bold; text-decoration: underline;">TODO</span><span style="color: #b8bb26;"> %?\n%U"</span> <span style="color: #fe8019;">:empty-lines</span> 1)

          (<span style="color: #b8bb26;">"s"</span> <span style="color: #b8bb26;">"Songs"</span> plain (file+headline <span style="color: #b8bb26;">"Songs.org"</span> <span style="color: #b8bb26;">"Songs"</span>)
           <span style="color: #b8bb26;">"%^{Song: } %?\n"</span>)
          )
        )

  (<span style="color: #fb4933;">setq</span> org-babel-interpreters
        (<span style="color: #fb4933;">quote</span>
         (<span style="color: #b8bb26;">"emacs-lisp"</span> <span style="color: #b8bb26;">"python"</span> <span style="color: #b8bb26;">"sh"</span> <span style="color: #b8bb26;">""</span>))
        )

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((shell . t)
     (python . t)
     (ruby . t)
     (latex . t)
     (perl . t)
     (emacs-lisp . t)
     (dot . t)))

  (<span style="color: #fb4933;">setq</span> org-latex-listings 'minted
    org-latex-packages-alist '((<span style="color: #b8bb26;">"newfloat"</span> <span style="color: #b8bb26;">"minted"</span>))
    org-latex-pdf-process
    '(<span style="color: #b8bb26;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
      <span style="color: #b8bb26;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>))

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">org crypt</span>
  (<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">org-crypt</span>)
  (org-crypt-use-before-save-magic)
  (<span style="color: #fb4933;">setq</span> org-crypt-tag-matcher <span style="color: #b8bb26;">"encrypt"</span>)
  (<span style="color: #fb4933;">setq</span> org-crypt-key <span style="color: #b8bb26;">"09852491"</span>) <span style="color: #7c6f64;">;; </span><span style="color: #ff0000; font-weight: bold; text-decoration: underline;">TODO</span><span style="color: #7c6f64;">: make it a constant</span>
  (add-to-list 'org-tags-exclude-from-inheritance (<span style="color: #fb4933;">quote</span> <span style="color: #b8bb26;">"encrypt"</span>))
  (add-to-list 'org-tags-exclude-from-inheritance (<span style="color: #fb4933;">quote</span> <span style="color: #b8bb26;">"crypt"</span>))

  <span style="color: #fe8019;">:bind</span> ((<span style="color: #b8bb26;">"M-p"</span> . #'org-publish))
  <span style="color: #fe8019;">:hook</span>
  (after-save-hook . my-after-save-hook)
  (org-mode-hook . my-org-mode-hook)
  )

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">"stolen" from Protesilaos Stavrou Config</span>
(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">org-agenda</span>
  <span style="color: #fe8019;">:after</span> org
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:config</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Basic setup</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-span 14)
  (<span style="color: #fb4933;">setq</span> org-agenda-start-on-weekday 1)  <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">Monday</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-confirm-kill t)
  (<span style="color: #fb4933;">setq</span> org-agenda-show-all-dates t)
  (<span style="color: #fb4933;">setq</span> org-agenda-show-outline-path nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-window-setup 'current-window)
  (<span style="color: #fb4933;">setq</span> org-agenda-skip-comment-trees t)
  (<span style="color: #fb4933;">setq</span> org-agenda-menu-show-matcher t)
  (<span style="color: #fb4933;">setq</span> org-agenda-menu-two-columns nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-sticky nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-custom-commands-contexts nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-max-entries nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-max-todos nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-max-tags nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-max-effort nil)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">General view options</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-prefix-format
        '((agenda . <span style="color: #b8bb26;">" %i %-12:c%?-12t% s"</span>)
          (todo . <span style="color: #b8bb26;">" %i %-12:c"</span>)
          (tags . <span style="color: #b8bb26;">" %i %-12:c"</span>)
          (search . <span style="color: #b8bb26;">" %i %-12:c"</span>)))
  (<span style="color: #fb4933;">setq</span> org-agenda-sorting-strategy
        '(((agenda habit-down time-up priority-down category-keep)
           (todo priority-down category-keep)
           (tags priority-down category-keep)
           (search category-keep))))
  (<span style="color: #fb4933;">setq</span> org-agenda-breadcrumbs-separator <span style="color: #b8bb26;">"-&gt;"</span>)
  (<span style="color: #fb4933;">setq</span> org-agenda-todo-keyword-format <span style="color: #b8bb26;">"%-1s"</span>)
  (<span style="color: #fb4933;">setq</span> org-agenda-diary-sexp-prefix nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-fontify-priorities 'cookies)
  (<span style="color: #fb4933;">setq</span> org-agenda-category-icon-alist nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-remove-times-when-in-prefix nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-remove-timeranges-from-blocks nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-compact-blocks nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-block-separator ?&#8212;)

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">prot/org-agenda-format-date-aligned</span> (date)
    <span style="color: #b8bb26;">"Format a DATE string for display in the daily/weekly agenda.</span>
<span style="color: #b8bb26;">This function makes sure that dates are aligned for easy reading.</span>

<span style="color: #b8bb26;">Slightly tweaked version of `</span><span style="color: #d3869b;">org-agenda-format-date-aligned</span><span style="color: #b8bb26;">' that</span>
<span style="color: #b8bb26;">produces dates with a fixed length."</span>
    (<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">cal-iso</span>)
    (<span style="color: #fb4933;">let*</span> ((dayname (calendar-day-name date t))
       (day (cadr date))
       (day-of-week (calendar-day-of-week date))
       (month (car date))
       (monthname (calendar-month-name month t))
       (year (nth 2 date))
       (iso-week (org-days-to-iso-week
              (calendar-absolute-from-gregorian date)))
       (weekyear (<span style="color: #fb4933;">cond</span> ((<span style="color: #fb4933;">and</span> (= month 1) (&gt;= iso-week 52))
                (1- year))
               ((<span style="color: #fb4933;">and</span> (= month 12) (&lt;= iso-week 1))
                (1+ year))
               (t year)))
       (weekstring (<span style="color: #fb4933;">if</span> (= day-of-week 1)
               (format <span style="color: #b8bb26;">" (W%02d)"</span> iso-week)
             <span style="color: #b8bb26;">""</span>)))
      (format <span style="color: #b8bb26;">"%s %2d %s %4d%s"</span>
          dayname day monthname year weekstring)))

  (<span style="color: #fb4933;">setq</span> org-agenda-format-date #'prot/org-agenda-format-date-aligned)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Marks</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-bulk-mark-char <span style="color: #b8bb26;">"#"</span>)
  (<span style="color: #fb4933;">setq</span> org-agenda-persistent-marks nil)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Diary entries</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-insert-diary-strategy 'date-tree)
  (<span style="color: #fb4933;">setq</span> org-agenda-insert-diary-extract-time nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-include-diary t)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Follow mode</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-start-with-follow-mode nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-follow-indirect t)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Multi-item tasks</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-dim-blocked-tasks t)
  (<span style="color: #fb4933;">setq</span> org-agenda-todo-list-sublevels t)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Filters and restricted views</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-persistent-filter nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-restriction-lock-highlight-subtree t)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Items with deadline and scheduled timestamps</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-include-deadlines t)
  (<span style="color: #fb4933;">setq</span> org-deadline-warning-days 5)
  (<span style="color: #fb4933;">setq</span> org-agenda-skip-scheduled-if-done nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-skip-scheduled-if-deadline-is-shown t)
  (<span style="color: #fb4933;">setq</span> org-agenda-skip-timestamp-if-deadline-is-shown t)
  (<span style="color: #fb4933;">setq</span> org-agenda-skip-deadline-if-done nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-skip-deadline-prewarning-if-scheduled 1)
  (<span style="color: #fb4933;">setq</span> org-agenda-skip-scheduled-delay-if-deadline nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-skip-additional-timestamps-same-entry nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-skip-timestamp-if-done nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-search-headline-for-time t)
  (<span style="color: #fb4933;">setq</span> org-scheduled-past-days 365)
  (<span style="color: #fb4933;">setq</span> org-deadline-past-days 365)
  (<span style="color: #fb4933;">setq</span> org-agenda-move-date-from-past-immediately-to-today t)
  (<span style="color: #fb4933;">setq</span> org-agenda-show-future-repeats t)
  (<span style="color: #fb4933;">setq</span> org-agenda-prefer-last-repeat nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-timerange-leaders
        '(<span style="color: #b8bb26;">""</span> <span style="color: #b8bb26;">"(%d/%d): "</span>))
  (<span style="color: #fb4933;">setq</span> org-agenda-scheduled-leaders
        '(<span style="color: #b8bb26;">"Scheduled: "</span> <span style="color: #b8bb26;">"Sched.%2dx: "</span>))
  (<span style="color: #fb4933;">setq</span> org-agenda-inactive-leader <span style="color: #b8bb26;">"["</span>)
  (<span style="color: #fb4933;">setq</span> org-agenda-deadline-leaders
        '(<span style="color: #b8bb26;">"Deadline:  "</span> <span style="color: #b8bb26;">"In %3d d.: "</span> <span style="color: #b8bb26;">"%2d d. ago: "</span>))
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Time grid</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-time-leading-zero t)
  (<span style="color: #fb4933;">setq</span> org-agenda-timegrid-use-ampm nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-use-time-grid t)
  (<span style="color: #fb4933;">setq</span> org-agenda-show-current-time-in-grid t)
  (<span style="color: #fb4933;">setq</span> org-agenda-current-time-string
        <span style="color: #b8bb26;">"&#8212;&#183;&#8212;&#183;&#8212;&#183;&#8212;&#183;&#8212;&#183;&#8212;&#183;&#8212;&#183;&#8212;&#183;&#8212;"</span>)
  (<span style="color: #fb4933;">setq</span> org-agenda-time-grid
        '((daily today require-timed)
          (0700 0800 0900 1000 1100
                1200 1300 1400 1500 1600
                1700 1800 1900 2000 2100)
          <span style="color: #b8bb26;">" -----"</span> <span style="color: #b8bb26;">"&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;"</span>))
  (<span style="color: #fb4933;">setq</span> org-agenda-default-appointment-duration nil)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Global to-do list</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-todo-ignore-with-date t)
  (<span style="color: #fb4933;">setq</span> org-agenda-todo-ignore-timestamp t)
  (<span style="color: #fb4933;">setq</span> org-agenda-todo-ignore-scheduled t)
  (<span style="color: #fb4933;">setq</span> org-agenda-todo-ignore-deadlines t)
  (<span style="color: #fb4933;">setq</span> org-agenda-todo-ignore-time-comparison-use-seconds t)
  (<span style="color: #fb4933;">setq</span> org-agenda-tags-todo-honor-ignore-options nil)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Tagged items</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-show-inherited-tags t)
  (<span style="color: #fb4933;">setq</span> org-agenda-use-tag-inheritance
        '(todo search agenda))
  (<span style="color: #fb4933;">setq</span> org-agenda-hide-tags-regexp nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-remove-tags nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-tags-column -120)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Agenda entry</span>
  <span style="color: #7c6f64;">;;</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #006400; font-weight: bold; text-decoration: underline;">NOTE</span><span style="color: #7c6f64;"> I do not use this right now.  Leaving everything to its</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">default value.</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-start-with-entry-text-mode nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-entry-text-maxlines 5)
  (<span style="color: #fb4933;">setq</span> org-agenda-entry-text-exclude-regexps nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-entry-text-leaders <span style="color: #b8bb26;">"    &gt; "</span>)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Logging, clocking</span>
  <span style="color: #7c6f64;">;;</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #006400; font-weight: bold; text-decoration: underline;">NOTE</span><span style="color: #7c6f64;"> I do not use these yet, though I plan to.  Leaving everything to</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">its default value for the time being.</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-log-mode-items '(closed clock))
  (<span style="color: #fb4933;">setq</span> org-agenda-clock-consistency-checks
        '((<span style="color: #fe8019;">:max-duration</span> <span style="color: #b8bb26;">"10:00"</span> <span style="color: #fe8019;">:min-duration</span> 0 <span style="color: #fe8019;">:max-gap</span> <span style="color: #b8bb26;">"0:05"</span> <span style="color: #fe8019;">:gap-ok-around</span>
                         (<span style="color: #b8bb26;">"4:00"</span>)
                         <span style="color: #fe8019;">:default-face</span> <span style="color: #7c6f64;">; </span><span style="color: #7c6f64;">This should definitely be reviewed</span>
                         ((<span style="color: #fe8019;">:background</span> <span style="color: #b8bb26;">"DarkRed"</span>)
                          (<span style="color: #fe8019;">:foreground</span> <span style="color: #b8bb26;">"white"</span>))
                         <span style="color: #fe8019;">:overlap-face</span> nil <span style="color: #fe8019;">:gap-face</span> nil <span style="color: #fe8019;">:no-end-time-face</span> nil
                         <span style="color: #fe8019;">:long-face</span> nil <span style="color: #fe8019;">:short-face</span> nil)))
  (<span style="color: #fb4933;">setq</span> org-agenda-log-mode-add-notes t)
  (<span style="color: #fb4933;">setq</span> org-agenda-start-with-log-mode nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-start-with-clockreport-mode nil)

  (<span style="color: #fb4933;">setq</span> org-agenda-clockreport-parameter-plist '(<span style="color: #fe8019;">:link</span> t <span style="color: #fe8019;">:maxlevel</span> 2))
  (<span style="color: #fb4933;">setq</span> org-agenda-search-view-always-boolean nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-search-view-force-full-words nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-search-view-max-outline-level 0)
  (<span style="color: #fb4933;">setq</span> org-agenda-search-headline-for-time t)
  (<span style="color: #fb4933;">setq</span> org-agenda-use-time-grid t)
  (<span style="color: #fb4933;">setq</span> org-agenda-cmp-user-defined nil)
  (<span style="color: #fb4933;">setq</span> org-sort-agenda-notime-is-late t)
  (<span style="color: #fb4933;">setq</span> org-sort-agenda-noeffort-is-high t)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Agenda column view</span>
  <span style="color: #7c6f64;">;;</span>
  <span style="color: #7c6f64;">;; </span><span style="color: #006400; font-weight: bold; text-decoration: underline;">NOTE</span><span style="color: #7c6f64;"> I do not use these, but may need them in the future.</span>
  (<span style="color: #fb4933;">setq</span> org-agenda-view-columns-initially nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-columns-show-summaries t)
  (<span style="color: #fb4933;">setq</span> org-agenda-columns-compute-summary-properties t)
  (<span style="color: #fb4933;">setq</span> org-agenda-columns-add-appointments-to-effort-sum nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-auto-exclude-function nil)
  (<span style="color: #fb4933;">setq</span> org-agenda-bulk-custom-functions nil)

  <span style="color: #fe8019;">:bind</span> ((<span style="color: #b8bb26;">"C-c a"</span> . org-agenda)
         <span style="color: #fe8019;">:map</span> org-mode-map
         (<span style="color: #b8bb26;">"C-'"</span> . nil)
         (<span style="color: #b8bb26;">"C-,"</span> . nil)))

(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">org-src</span>
  <span style="color: #fe8019;">:after</span> org
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> org-src-window-setup 'current-window)
  (<span style="color: #fb4933;">setq</span> org-src-fontify-natively t)
  (<span style="color: #fb4933;">setq</span> org-src-preserve-indentation t)
  (<span style="color: #fb4933;">setq</span> org-src-tab-acts-natively t)
  (<span style="color: #fb4933;">setq</span> org-edit-src-content-indentation 0))

(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ol</span>
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> org-link-keep-stored-after-insertion t)
  )

(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">org-id</span>
  <span style="color: #fe8019;">:after</span> org
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:commands</span> (contrib/org-get-id
             contrib/org-id-headlines)
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id)

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">contrib/org-get-id</span> (<span style="color: #d3869b;">&amp;optional</span> pom create prefix)
    <span style="color: #b8bb26;">"Get the CUSTOM_ID property of the entry at point-or-marker</span>
<span style="color: #b8bb26;">POM. If POM is nil, refer to the entry at point. If the entry</span>
<span style="color: #b8bb26;">does not have an CUSTOM_ID, the function returns nil. However,</span>
<span style="color: #b8bb26;">when CREATE is non nil, create a CUSTOM_ID if none is present</span>
<span style="color: #b8bb26;">already. PREFIX will be passed through to `</span><span style="color: #d3869b;">org-id-new</span><span style="color: #b8bb26;">'. In any</span>
<span style="color: #b8bb26;">case, the CUSTOM_ID of the entry is returned."</span>
    (<span style="color: #fb4933;">interactive</span>)
    (<span style="color: #fb4933;">org-with-point-at</span> pom
      (<span style="color: #fb4933;">let</span> ((id (org-entry-get nil <span style="color: #b8bb26;">"CUSTOM_ID"</span>)))
        (<span style="color: #fb4933;">cond</span>
         ((<span style="color: #fb4933;">and</span> id (stringp id) (string-match <span style="color: #b8bb26;">"\\S-"</span> id))
          id)
         (create
          (<span style="color: #fb4933;">setq</span> id (org-id-new (concat prefix <span style="color: #b8bb26;">"h"</span>)))
          (org-entry-put pom <span style="color: #b8bb26;">"CUSTOM_ID"</span> id)
          (org-id-add-location id (buffer-file-name (buffer-base-buffer)))
          id)))))

  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">contrib/org-id-headlines</span> ()
    <span style="color: #b8bb26;">"Add CUSTOM_ID properties to all headlines in the current</span>
<span style="color: #b8bb26;">file which do not already have one."</span>
    (<span style="color: #fb4933;">interactive</span>)
    (org-map-entries (<span style="color: #fb4933;">lambda</span> ()
                       (contrib/org-get-id (point) 'create)))))

(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ox</span>
  <span style="color: #fe8019;">:after</span> org
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> org-export-with-section-numbers nil)
  (<span style="color: #fb4933;">setq</span> org-export-with-date nil)
  (<span style="color: #fb4933;">setq</span> org-export-time-stamp-file nil)
  (<span style="color: #fb4933;">setq</span> org-export-with-email t)
  (<span style="color: #fb4933;">setq</span> org-export-with-toc t)
  (<span style="color: #fb4933;">setq</span> org-export-headline-levels 8)
  (<span style="color: #fb4933;">setq</span> org-export-backends
        '(ascii html latex md))
  (<span style="color: #fb4933;">setq</span> org-export-dispatch-use-expert-ui nil)

  (<span style="color: #fb4933;">setq</span> org-html-validation-link nil)

  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">if headline has ignore tag, dont export it. But export its contents!</span>
  (<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">ox-extra</span>)
  (ox-extras-activate '(ignore-headlines))
  )

(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ox-gfm</span>)

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">if headline has ignore tag, dont export it. But export its contents!</span>
(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ox-extra</span>
  <span style="color: #fe8019;">:after</span> org
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:config</span>
  (ox-extras-activate '(ignore-headlines))
  )
</pre>
</div>
</div>
</div>
