other/emacs.org
** Paren

#+BEGIN_SRC emacs-lisp
(use-package paren
  :config
  (setq show-paren-style 'parenthesis)
  (setq show-paren-when-point-in-periphery t)
  (setq show-paren-when-point-inside-paren nil)
  :hook (after-init-hook . show-paren-mode)
  )
#+END_SRC

** Popwin

#+BEGIN_SRC emacs-lisp
(use-package popwin
  :init
  (customize-set-variable 'popwin:popup-window-height 0.5)
  :config
  (popwin-mode 1)
  (setq display-buffer-function 'popwin:display-buffer)
  )
#+END_SRC
** Projectile

#+BEGIN_SRC emacs-lisp
(use-package projectile
  :diminish
  :config
  (projectile-mode +1))
#+END_SRC

** Px

#+BEGIN_SCR emacs-lisp
(use-package px)
#+END_SRC
** Rg

#+BEGIN_SRC emacs-lisp
(use-package rg
  :ensure
  :defer
  :config
  (setq rg-group-result t)
  (setq rg-hide-command t)
  (setq rg-show-columns nil)
  (setq rg-show-header t)
  (setq rg-custom-type-aliases nil)
  (setq rg-default-alias-fallback "all")
  )
#+END_SRC
** Save Place

#+BEGIN_SRC emacs-lisp
(use-package saveplace
  :ensure nil
  :hook (after-init-hook . save-place-mode))
#+END_SRC
** Server

#+BEGIN_SRC emacs-lisp
(use-package server
  :ensure nil
  :hook (after-init-hook . server-mode))
#+END_SRC

** So Long

#+BEGIN_SRC emacs-lisp
(use-package so-long
  :config
  (global-so-long-mode))
#+END_SRC

** Uniquify

#+BEGIN_SRC emacs-lisp
(use-package uniquify
  :ensure nil
  :config
  (setq uniquify-buffer-name-style 'forward)
  (setq uniquify-strip-common-suffix t)
  (setq uniquify-after-kill-buffer-p t)
  (setq uniquify-separator "/")
  )
#+END_SRC

** Window

#+BEGIN_SRC emacs-lisp
(use-package window
  :ensure nil
  :init
  (setq window-combination-resize t)
  (setq even-window-sizes 'height-only)
  (setq window-sides-vertical nil)
  (setq switch-to-buffer-in-dedicated-window 'pop)
  :hook ((help-mode-hook . visual-line-mode)
         (custom-mode-hook . visual-line-mode))
  )
#+END_SRC

** Which-Func

#+BEGIN_SRC emacs-lisp
(use-package which-func
  :defer 5
  :config (which-function-mode 1))
#+END_SRC


* Last Steps

#+BEGIN_SRC emacs-lisp
(setq-default custom-file "~/.config/emacs/custom.el")
(load custom-file)
#+END_SRC

* Rest of configuration

#+BEGIN_SRC emacs-lisp
;; Configure `use-package' prior to loading it.

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; FUNCTIONS
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; CONFIGS
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


;; (add-hook 'text-mode-hook (lambda () (abbrev-mode -1)))
;; (add-hook 'c-mode-hook (lambda () (abbrev-mode -1)))
;; (add-hook 'c++-mode-hook (lambda () (abbrev-mode -1)))

;; (add-hook 'text-mode-hook (lambda () (TeX-PDF-mode -1)))
;; (add-hook 'c-mode-hook (lambda () (TeX-PDF-mode -1)))
;; (add-hook 'c++-mode-hook (lambda () (TeX-PDF-mode -1)))

;; (add-hook 'focus-out-hook #'garbage-collect)

(defalias 'yes-or-no-p #'y-or-n-p)

;; (add-hook 'minibuffer-setup-hook #'my-minibuffer-setup-hook)
;; (add-hook 'minibuffer-exit-hook #'my-minibuffer-exit-hook)

;; backups


;; disable warning when killing buffers
(setq-default kill-buffer-query-functions
	      (remq 'process-kill-buffer-query-function
		    kill-buffer-query-functions))

;; custom file

;; (fringe-mode '(nil . 0))
;; (set-fringe-mode 0)
;; (set-fringe-mode fringe-mode)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PACKAGES
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;



;; Automatically reload files was modified by external progra

;; Remember location in file


;; (use-package cmake-mode)
#+END_SRC

* FOOTER                                                                                              :ignore:
:PROPERTIES:
:clearpage: t
:END:
#+BEGIN_EXPORT html
<hr>
<footer>
        <div class="container">
            <ul class="menu-list">
                <li class="menu-list-item flex-basis-100-margin fit-content">
                    <a href="/index.html">Home</a>
                </li>
                <li class="menu-list-item flex-basis-100-margin fit-content">
                    <a href="/articles/articles.html">Articles</a>
                </li>
                <li class="menu-list-item flex-basis-100-margin fit-content">
                    <a href="/writeups/htb/index.html">Write-Ups</a>
                </li>
                <li class="menu-list-item flex-basis-100-margin fit-content">
                    <a class="inactive-link">03-06-2021</a>
                </li>
            </ul>
        </div>
</footer>
#+END_EXPORT
