other/emacs.html

<div id="outline-container-org59625ec" class="outline-3">
<h3 id="org59625ec">Paren</h3>
<div class="outline-text-3" id="text-org59625ec">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">paren</span>
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> show-paren-style 'parenthesis)
  (<span style="color: #fb4933;">setq</span> show-paren-when-point-in-periphery t)
  (<span style="color: #fb4933;">setq</span> show-paren-when-point-inside-paren nil)
  <span style="color: #fe8019;">:hook</span> (after-init-hook . show-paren-mode)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org203fd51" class="outline-3">
<h3 id="org203fd51">Popwin</h3>
<div class="outline-text-3" id="text-org203fd51">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">popwin</span>
  <span style="color: #fe8019;">:init</span>
  (customize-set-variable 'popwin:popup-window-height 0.5)
  <span style="color: #fe8019;">:config</span>
  (popwin-mode 1)
  (<span style="color: #fb4933;">setq</span> display-buffer-function 'popwin:display-buffer)
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-org717c8d5" class="outline-3">
<h3 id="org717c8d5">Projectile</h3>
<div class="outline-text-3" id="text-org717c8d5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">projectile</span>
  <span style="color: #fe8019;">:diminish</span>
  <span style="color: #fe8019;">:config</span>
  (projectile-mode +1))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf28118" class="outline-3">
<h3 id="orgaf28118">Px</h3>
<div class="outline-text-3" id="text-orgaf28118">
<p>
#+BEGIN<sub>SCR</sub> emacs-lisp
(use-package px)
#+END<sub>SRC</sub>
</p>
</div>
</div>
<div id="outline-container-org48897cf" class="outline-3">
<h3 id="org48897cf">Rg</h3>
<div class="outline-text-3" id="text-org48897cf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">rg</span>
  <span style="color: #fe8019;">:ensure</span>
  <span style="color: #fe8019;">:defer</span>
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> rg-group-result t)
  (<span style="color: #fb4933;">setq</span> rg-hide-command t)
  (<span style="color: #fb4933;">setq</span> rg-show-columns nil)
  (<span style="color: #fb4933;">setq</span> rg-show-header t)
  (<span style="color: #fb4933;">setq</span> rg-custom-type-aliases nil)
  (<span style="color: #fb4933;">setq</span> rg-default-alias-fallback <span style="color: #b8bb26;">"all"</span>)
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-org08ff02f" class="outline-3">
<h3 id="org08ff02f">Save Place</h3>
<div class="outline-text-3" id="text-org08ff02f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">saveplace</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:hook</span> (after-init-hook . save-place-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e4b9b3" class="outline-3">
<h3 id="org2e4b9b3">Server</h3>
<div class="outline-text-3" id="text-org2e4b9b3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">server</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:hook</span> (after-init-hook . server-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe1fa26" class="outline-3">
<h3 id="orgfe1fa26">So Long</h3>
<div class="outline-text-3" id="text-orgfe1fa26">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">so-long</span>
  <span style="color: #fe8019;">:config</span>
  (global-so-long-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org86a6305" class="outline-3">
<h3 id="org86a6305">Uniquify</h3>
<div class="outline-text-3" id="text-org86a6305">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">uniquify</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:config</span>
  (<span style="color: #fb4933;">setq</span> uniquify-buffer-name-style 'forward)
  (<span style="color: #fb4933;">setq</span> uniquify-strip-common-suffix t)
  (<span style="color: #fb4933;">setq</span> uniquify-after-kill-buffer-p t)
  (<span style="color: #fb4933;">setq</span> uniquify-separator <span style="color: #b8bb26;">"/"</span>)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcde331a" class="outline-3">
<h3 id="orgcde331a">Window</h3>
<div class="outline-text-3" id="text-orgcde331a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">window</span>
  <span style="color: #fe8019;">:ensure</span> nil
  <span style="color: #fe8019;">:init</span>
  (<span style="color: #fb4933;">setq</span> window-combination-resize t)
  (<span style="color: #fb4933;">setq</span> even-window-sizes 'height-only)
  (<span style="color: #fb4933;">setq</span> window-sides-vertical nil)
  (<span style="color: #fb4933;">setq</span> switch-to-buffer-in-dedicated-window 'pop)
  <span style="color: #fe8019;">:hook</span> ((help-mode-hook . visual-line-mode)
         (custom-mode-hook . visual-line-mode))
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9bc76e" class="outline-3">
<h3 id="orgd9bc76e">Which-Func</h3>
<div class="outline-text-3" id="text-orgd9bc76e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">which-func</span>
  <span style="color: #fe8019;">:defer</span> 5
  <span style="color: #fe8019;">:config</span> (which-function-mode 1))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orga129ddf" class="outline-2">
<h2 id="orga129ddf">Last Steps</h2>
<div class="outline-text-2" id="text-orga129ddf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq-default</span> custom-file <span style="color: #b8bb26;">"~/.config/emacs/custom.el"</span>)
(load custom-file)
</pre>
</div>
</div>
</div>

<div id="outline-container-org674ee98" class="outline-2">
<h2 id="org674ee98">Rest of configuration</h2>
<div class="outline-text-2" id="text-org674ee98">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Configure `</span><span style="color: #d3869b;">use-package</span><span style="color: #7c6f64;">' prior to loading it.</span>

<span style="color: #7c6f64;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">FUNCTIONS</span>
<span style="color: #7c6f64;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>


<span style="color: #7c6f64;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">CONFIGS</span>
<span style="color: #7c6f64;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>


<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(add-hook 'text-mode-hook (lambda () (abbrev-mode -1)))</span>
<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(add-hook 'c-mode-hook (lambda () (abbrev-mode -1)))</span>
<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(add-hook 'c++-mode-hook (lambda () (abbrev-mode -1)))</span>

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(add-hook 'text-mode-hook (lambda () (TeX-PDF-mode -1)))</span>
<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(add-hook 'c-mode-hook (lambda () (TeX-PDF-mode -1)))</span>
<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(add-hook 'c++-mode-hook (lambda () (TeX-PDF-mode -1)))</span>

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(add-hook 'focus-out-hook #'garbage-collect)</span>

(<span style="color: #fb4933;">defalias</span> '<span style="color: #fabd2f;">yes-or-no-p</span> #'y-or-n-p)

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(add-hook 'minibuffer-setup-hook #'my-minibuffer-setup-hook)</span>
<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(add-hook 'minibuffer-exit-hook #'my-minibuffer-exit-hook)</span>

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">backups</span>


<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">disable warning when killing buffers</span>
(<span style="color: #fb4933;">setq-default</span> kill-buffer-query-functions
          (remq 'process-kill-buffer-query-function
            kill-buffer-query-functions))

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">custom file</span>

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(fringe-mode '(nil . 0))</span>
<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(set-fringe-mode 0)</span>
<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(set-fringe-mode fringe-mode)</span>

<span style="color: #7c6f64;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">PACKAGES</span>
<span style="color: #7c6f64;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>



<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Automatically reload files was modified by external progra</span>

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">Remember location in file</span>


<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(use-package cmake-mode)</span>
</pre>
</div>
</div>
</div>

<hr>
<footer>
<p class="footer_right">30-05-2021</p>
<p><a class="footer" href="/index.html">Homepage</a></p>
<p><a class="footer" href="/writeups/htb/index.html">Back</a></p>
<div style="clear: both;"></div>
</footer>
</div>
</body>
</html>
